sriharimaddula/ble-sdk6-examples/SDK_6.0.24.1464/DA145xx_SDK/6.0.24.1464/sdk/platform/driver/ble/reg_ripple.h
/**
 ****************************************************************************************
 *
 * @file reg_ripple.h
 *
 * @brief Ripple register definitions
 *
 * Copyright (C) 2012-2025 Renesas Electronics Corporation and/or its affiliates.
 * All rights reserved. Confidential Information.
 *
 * This software ("Software") is supplied by Renesas Electronics Corporation and/or its
 * affiliates ("Renesas"). Renesas grants you a personal, non-exclusive, non-transferable,
 * revocable, non-sub-licensable right and license to use the Software, solely if used in
 * or together with Renesas products. You may make copies of this Software, provided this
 * copyright notice and disclaimer ("Notice") is included in all such copies. Renesas
 * reserves the right to change or discontinue the Software at any time without notice.
 *
 * THE SOFTWARE IS PROVIDED "AS IS". RENESAS DISCLAIMS ALL WARRANTIES OF ANY KIND,
 * WHETHER EXPRESS, IMPLIED, OR STATUTORY, INCLUDING BUT NOT LIMITED TO THE WARRANTIES
 * OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NON-INFRINGEMENT. TO THE
 * MAXIMUM EXTENT PERMITTED UNDER LAW, IN NO EVENT SHALL RENESAS BE LIABLE FOR ANY DIRECT,
 * INDIRECT, SPECIAL, INCIDENTAL OR CONSEQUENTIAL DAMAGES ARISING FROM, OUT OF OR IN
 * CONNECTION WITH THE SOFTWARE, EVEN IF RENESAS HAS BEEN ADVISED OF THE POSSIBILITY OF
 * SUCH DAMAGES. USE OF THIS SOFTWARE MAY BE SUBJECT TO TERMS AND CONDITIONS CONTAINED IN
 * AN ADDITIONAL AGREEMENT BETWEEN YOU AND RENESAS. IN CASE OF CONFLICT BETWEEN THE TERMS
 * OF THIS NOTICE AND ANY SUCH ADDITIONAL LICENSE AGREEMENT, THE TERMS OF THE AGREEMENT
 * SHALL TAKE PRECEDENCE. BY CONTINUING TO USE THIS SOFTWARE, YOU AGREE TO THE TERMS OF
 * THIS NOTICE.IF YOU DO NOT AGREE TO THESE TERMS, YOU ARE NOT PERMITTED TO USE THIS
 * SOFTWARE.
 *
 ****************************************************************************************
 */

#ifndef _REG_RIPPLE_H_
#define _REG_RIPPLE_H_

#include <stdint.h>
#include "_reg_ripple.h"
#include "compiler.h"
#include "arch.h"
#include "reg_access.h"

#define REG_RIPPLE_COUNT 32

#define REG_RIPPLE_DECODING_MASK 0x0000007F

/**
 * @brief BTRFIP_VER register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  31:24                  TYP   0x1
 *  23:16                  REL   0x1
 *  15:08                  UPG   0x7
 *  07:00                BUILD   0x0
 * </pre>
 */
#define RPL_BTRFIP_VER_ADDR   0x00000000
#define RPL_BTRFIP_VER_OFFSET 0x00000000
#define RPL_BTRFIP_VER_INDEX  0x00000000
#define RPL_BTRFIP_VER_RESET  0x01010700

__STATIC_FORCEINLINE uint32_t rpl_btrfip_ver_get(void)
{
    return REG_RPL_RD(RPL_BTRFIP_VER_ADDR);
}

// field definitions
#define RPL_TYP_MASK     ((uint32_t)0xFF000000)
#define RPL_TYP_LSB      24
#define RPL_TYP_WIDTH    ((uint32_t)0x00000008)
#define RPL_REL_MASK     ((uint32_t)0x00FF0000)
#define RPL_REL_LSB      16
#define RPL_REL_WIDTH    ((uint32_t)0x00000008)
#define RPL_UPG_MASK     ((uint32_t)0x0000FF00)
#define RPL_UPG_LSB      8
#define RPL_UPG_WIDTH    ((uint32_t)0x00000008)
#define RPL_BUILD_MASK   ((uint32_t)0x000000FF)
#define RPL_BUILD_LSB    0
#define RPL_BUILD_WIDTH  ((uint32_t)0x00000008)

#define RPL_TYP_RST      0x1
#define RPL_REL_RST      0x1
#define RPL_UPG_RST      0x7
#define RPL_BUILD_RST    0x0

__STATIC_FORCEINLINE void rpl_btrfip_ver_unpack(uint8_t* typ, uint8_t* rel, uint8_t* upg, uint8_t* build)
{
    uint32_t localVal = REG_RPL_RD(RPL_BTRFIP_VER_ADDR);

    *typ = (localVal & ((uint32_t)0xFF000000)) >> 24;
    *rel = (localVal & ((uint32_t)0x00FF0000)) >> 16;
    *upg = (localVal & ((uint32_t)0x0000FF00)) >> 8;
    *build = (localVal & ((uint32_t)0x000000FF)) >> 0;
}

__STATIC_FORCEINLINE uint8_t rpl_typ_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_BTRFIP_VER_ADDR);
    return ((localVal & ((uint32_t)0xFF000000)) >> 24);
}

__STATIC_FORCEINLINE uint8_t rpl_rel_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_BTRFIP_VER_ADDR);
    return ((localVal & ((uint32_t)0x00FF0000)) >> 16);
}

__STATIC_FORCEINLINE uint8_t rpl_upg_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_BTRFIP_VER_ADDR);
    return ((localVal & ((uint32_t)0x0000FF00)) >> 8);
}

__STATIC_FORCEINLINE uint8_t rpl_build_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_BTRFIP_VER_ADDR);
    return ((localVal & ((uint32_t)0x000000FF)) >> 0);
}

/**
 * @brief RFDYNCNTL register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  23:20          TX_EDR_GAIN   0x0
 *  19:16         TX_GFSK_GAIN   0x0
 *  14:08              CHANNEL   0x0
 *     07              BTLE_EN   0
 *     04                RX_EN   0
 *     01               TX_EDR   0
 *     00                TX_EN   0
 * </pre>
 */
#define RPL_RFDYNCNTL_ADDR   0x00000001
#define RPL_RFDYNCNTL_OFFSET 0x00000001
#define RPL_RFDYNCNTL_INDEX  0x00000001
#define RPL_RFDYNCNTL_RESET  0x00000000

__STATIC_FORCEINLINE uint32_t rpl_rfdyncntl_get(void)
{
    return REG_RPL_RD(RPL_RFDYNCNTL_ADDR);
}

__STATIC_FORCEINLINE void rpl_rfdyncntl_set(uint32_t value)
{
    REG_RPL_WR(RPL_RFDYNCNTL_ADDR, value);
}

// field definitions
#define RPL_TX_EDR_GAIN_MASK    ((uint32_t)0x00F00000)
#define RPL_TX_EDR_GAIN_LSB     20
#define RPL_TX_EDR_GAIN_WIDTH   ((uint32_t)0x00000004)
#define RPL_TX_GFSK_GAIN_MASK   ((uint32_t)0x000F0000)
#define RPL_TX_GFSK_GAIN_LSB    16
#define RPL_TX_GFSK_GAIN_WIDTH  ((uint32_t)0x00000004)
#define RPL_CHANNEL_MASK        ((uint32_t)0x00007F00)
#define RPL_CHANNEL_LSB         8
#define RPL_CHANNEL_WIDTH       ((uint32_t)0x00000007)
#define RPL_BTLE_EN_BIT         ((uint32_t)0x00000080)
#define RPL_BTLE_EN_POS         7
#define RPL_RX_EN_BIT           ((uint32_t)0x00000010)
#define RPL_RX_EN_POS           4
#define RPL_TX_EDR_BIT          ((uint32_t)0x00000002)
#define RPL_TX_EDR_POS          1
#define RPL_TX_EN_BIT           ((uint32_t)0x00000001)
#define RPL_TX_EN_POS           0

#define RPL_TX_EDR_GAIN_RST     0x0
#define RPL_TX_GFSK_GAIN_RST    0x0
#define RPL_CHANNEL_RST         0x0
#define RPL_BTLE_EN_RST         0x0
#define RPL_RX_EN_RST           0x0
#define RPL_TX_EDR_RST          0x0
#define RPL_TX_EN_RST           0x0

