sriharimaddula/ble-sdk6-examples/SDK_6.0.24.1464/DA145xx_SDK/6.0.24.1464/sdk/platform/driver/ble/reg_ripple.h
    *rxflagcheck = (localVal & ((uint32_t)0x0F000000)) >> 24;
    *rxdivfactor = (localVal & ((uint32_t)0x001F0000)) >> 16;
    *txflagcheck = (localVal & ((uint32_t)0x00000F00)) >> 8;
    *txdivfactor = (localVal & ((uint32_t)0x0000001F)) >> 0;
}

__STATIC_FORCEINLINE uint8_t rpl_rx_flag_check_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_SEQCNTL_ADDR);
    return ((localVal & ((uint32_t)0x0F000000)) >> 24);
}

__STATIC_FORCEINLINE void rpl_rx_flag_check_setf(uint8_t rxflagcheck)
{
    ASSERT_ERR((((uint32_t)rxflagcheck << 24) & ~((uint32_t)0x0F000000)) == 0);
    REG_RPL_WR(RPL_SEQCNTL_ADDR, (REG_RPL_RD(RPL_SEQCNTL_ADDR) & ~((uint32_t)0x0F000000)) | ((uint32_t)rxflagcheck << 24));
}

__STATIC_FORCEINLINE uint8_t rpl_rx_div_factor_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_SEQCNTL_ADDR);
    return ((localVal & ((uint32_t)0x001F0000)) >> 16);
}

__STATIC_FORCEINLINE void rpl_rx_div_factor_setf(uint8_t rxdivfactor)
{
    ASSERT_ERR((((uint32_t)rxdivfactor << 16) & ~((uint32_t)0x001F0000)) == 0);
    REG_RPL_WR(RPL_SEQCNTL_ADDR, (REG_RPL_RD(RPL_SEQCNTL_ADDR) & ~((uint32_t)0x001F0000)) | ((uint32_t)rxdivfactor << 16));
}

__STATIC_FORCEINLINE uint8_t rpl_tx_flag_check_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_SEQCNTL_ADDR);
    return ((localVal & ((uint32_t)0x00000F00)) >> 8);
}

__STATIC_FORCEINLINE void rpl_tx_flag_check_setf(uint8_t txflagcheck)
{
    ASSERT_ERR((((uint32_t)txflagcheck << 8) & ~((uint32_t)0x00000F00)) == 0);
    REG_RPL_WR(RPL_SEQCNTL_ADDR, (REG_RPL_RD(RPL_SEQCNTL_ADDR) & ~((uint32_t)0x00000F00)) | ((uint32_t)txflagcheck << 8));
}

__STATIC_FORCEINLINE uint8_t rpl_tx_div_factor_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_SEQCNTL_ADDR);
    return ((localVal & ((uint32_t)0x0000001F)) >> 0);
}

__STATIC_FORCEINLINE void rpl_tx_div_factor_setf(uint8_t txdivfactor)
{
    ASSERT_ERR((((uint32_t)txdivfactor << 0) & ~((uint32_t)0x0000001F)) == 0);
    REG_RPL_WR(RPL_SEQCNTL_ADDR, (REG_RPL_RD(RPL_SEQCNTL_ADDR) & ~((uint32_t)0x0000001F)) | ((uint32_t)txdivfactor << 0));
}

/**
 * @brief RFTXUP_DLY0 register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  31:22           TX_UP_DLY2   0x19
 *  20:11           TX_UP_DLY1   0x206
 *  09:00           TX_UP_DLY0   0x1
 * </pre>
 */
#define RPL_RFTXUP_DLY0_ADDR   0x00000003
#define RPL_RFTXUP_DLY0_OFFSET 0x00000003
#define RPL_RFTXUP_DLY0_INDEX  0x00000003
#define RPL_RFTXUP_DLY0_RESET  0x06503001

__STATIC_FORCEINLINE uint32_t rpl_rftxup_dly0_get(void)
{
    return REG_RPL_RD(RPL_RFTXUP_DLY0_ADDR);
}

__STATIC_FORCEINLINE void rpl_rftxup_dly0_set(uint32_t value)
{
    REG_RPL_WR(RPL_RFTXUP_DLY0_ADDR, value);
}

// field definitions
#define RPL_TX_UP_DLY2_MASK   ((uint32_t)0xFFC00000)
#define RPL_TX_UP_DLY2_LSB    22
#define RPL_TX_UP_DLY2_WIDTH  ((uint32_t)0x0000000A)
#define RPL_TX_UP_DLY1_MASK   ((uint32_t)0x001FF800)
#define RPL_TX_UP_DLY1_LSB    11
#define RPL_TX_UP_DLY1_WIDTH  ((uint32_t)0x0000000A)
#define RPL_TX_UP_DLY0_MASK   ((uint32_t)0x000003FF)
#define RPL_TX_UP_DLY0_LSB    0
#define RPL_TX_UP_DLY0_WIDTH  ((uint32_t)0x0000000A)

#define RPL_TX_UP_DLY2_RST    0x19
#define RPL_TX_UP_DLY1_RST    0x206
#define RPL_TX_UP_DLY0_RST    0x1

__STATIC_FORCEINLINE void rpl_rftxup_dly0_pack(uint16_t txupdly2, uint16_t txupdly1, uint16_t txupdly0)
{
    ASSERT_ERR((((uint32_t)txupdly2 << 22) & ~((uint32_t)0xFFC00000)) == 0);
    ASSERT_ERR((((uint32_t)txupdly1 << 11) & ~((uint32_t)0x001FF800)) == 0);
    ASSERT_ERR((((uint32_t)txupdly0 << 0) & ~((uint32_t)0x000003FF)) == 0);
    REG_RPL_WR(RPL_RFTXUP_DLY0_ADDR,  ((uint32_t)txupdly2 << 22) | ((uint32_t)txupdly1 << 11) | ((uint32_t)txupdly0 << 0));
}

__STATIC_FORCEINLINE void rpl_rftxup_dly0_unpack(uint16_t* txupdly2, uint16_t* txupdly1, uint16_t* txupdly0)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFTXUP_DLY0_ADDR);

    *txupdly2 = (localVal & ((uint32_t)0xFFC00000)) >> 22;
    *txupdly1 = (localVal & ((uint32_t)0x001FF800)) >> 11;
    *txupdly0 = (localVal & ((uint32_t)0x000003FF)) >> 0;
}

__STATIC_FORCEINLINE uint16_t rpl_tx_up_dly2_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFTXUP_DLY0_ADDR);
    return ((localVal & ((uint32_t)0xFFC00000)) >> 22);
}

__STATIC_FORCEINLINE void rpl_tx_up_dly2_setf(uint16_t txupdly2)
{
    ASSERT_ERR((((uint32_t)txupdly2 << 22) & ~((uint32_t)0xFFC00000)) == 0);
    REG_RPL_WR(RPL_RFTXUP_DLY0_ADDR, (REG_RPL_RD(RPL_RFTXUP_DLY0_ADDR) & ~((uint32_t)0xFFC00000)) | ((uint32_t)txupdly2 << 22));
}

__STATIC_FORCEINLINE uint16_t rpl_tx_up_dly1_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFTXUP_DLY0_ADDR);
    return ((localVal & ((uint32_t)0x001FF800)) >> 11);
}

__STATIC_FORCEINLINE void rpl_tx_up_dly1_setf(uint16_t txupdly1)
{
    ASSERT_ERR((((uint32_t)txupdly1 << 11) & ~((uint32_t)0x001FF800)) == 0);
    REG_RPL_WR(RPL_RFTXUP_DLY0_ADDR, (REG_RPL_RD(RPL_RFTXUP_DLY0_ADDR) & ~((uint32_t)0x001FF800)) | ((uint32_t)txupdly1 << 11));
}

__STATIC_FORCEINLINE uint16_t rpl_tx_up_dly0_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFTXUP_DLY0_ADDR);
    return ((localVal & ((uint32_t)0x000003FF)) >> 0);
}

__STATIC_FORCEINLINE void rpl_tx_up_dly0_setf(uint16_t txupdly0)
{
    ASSERT_ERR((((uint32_t)txupdly0 << 0) & ~((uint32_t)0x000003FF)) == 0);
    REG_RPL_WR(RPL_RFTXUP_DLY0_ADDR, (REG_RPL_RD(RPL_RFTXUP_DLY0_ADDR) & ~((uint32_t)0x000003FF)) | ((uint32_t)txupdly0 << 0));
}

/**
 * @brief RFTXUP_DLY1 register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  31:22           TX_UP_DLY5   0x1
 *  20:11           TX_UP_DLY4   0x1
 *  09:00           TX_UP_DLY3   0x19
 * </pre>
 */
#define RPL_RFTXUP_DLY1_ADDR   0x00000004
#define RPL_RFTXUP_DLY1_OFFSET 0x00000004
#define RPL_RFTXUP_DLY1_INDEX  0x00000004
#define RPL_RFTXUP_DLY1_RESET  0x00400819

__STATIC_FORCEINLINE uint32_t rpl_rftxup_dly1_get(void)
{
    return REG_RPL_RD(RPL_RFTXUP_DLY1_ADDR);
}

