sriharimaddula/ble-sdk6-examples/SDK_6.0.24.1464/DA145xx_SDK/6.0.24.1464/sdk/platform/driver/ble/reg_ripple.h
__STATIC_FORCEINLINE void rpl_rftxup_dly1_set(uint32_t value)
{
    REG_RPL_WR(RPL_RFTXUP_DLY1_ADDR, value);
}

// field definitions
#define RPL_TX_UP_DLY5_MASK   ((uint32_t)0xFFC00000)
#define RPL_TX_UP_DLY5_LSB    22
#define RPL_TX_UP_DLY5_WIDTH  ((uint32_t)0x0000000A)
#define RPL_TX_UP_DLY4_MASK   ((uint32_t)0x001FF800)
#define RPL_TX_UP_DLY4_LSB    11
#define RPL_TX_UP_DLY4_WIDTH  ((uint32_t)0x0000000A)
#define RPL_TX_UP_DLY3_MASK   ((uint32_t)0x000003FF)
#define RPL_TX_UP_DLY3_LSB    0
#define RPL_TX_UP_DLY3_WIDTH  ((uint32_t)0x0000000A)

#define RPL_TX_UP_DLY5_RST    0x1
#define RPL_TX_UP_DLY4_RST    0x1
#define RPL_TX_UP_DLY3_RST    0x19

__STATIC_FORCEINLINE void rpl_rftxup_dly1_pack(uint16_t txupdly5, uint16_t txupdly4, uint16_t txupdly3)
{
    ASSERT_ERR((((uint32_t)txupdly5 << 22) & ~((uint32_t)0xFFC00000)) == 0);
    ASSERT_ERR((((uint32_t)txupdly4 << 11) & ~((uint32_t)0x001FF800)) == 0);
    ASSERT_ERR((((uint32_t)txupdly3 << 0) & ~((uint32_t)0x000003FF)) == 0);
    REG_RPL_WR(RPL_RFTXUP_DLY1_ADDR,  ((uint32_t)txupdly5 << 22) | ((uint32_t)txupdly4 << 11) | ((uint32_t)txupdly3 << 0));
}

__STATIC_FORCEINLINE void rpl_rftxup_dly1_unpack(uint16_t* txupdly5, uint16_t* txupdly4, uint16_t* txupdly3)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFTXUP_DLY1_ADDR);

    *txupdly5 = (localVal & ((uint32_t)0xFFC00000)) >> 22;
    *txupdly4 = (localVal & ((uint32_t)0x001FF800)) >> 11;
    *txupdly3 = (localVal & ((uint32_t)0x000003FF)) >> 0;
}

__STATIC_FORCEINLINE uint16_t rpl_tx_up_dly5_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFTXUP_DLY1_ADDR);
    return ((localVal & ((uint32_t)0xFFC00000)) >> 22);
}

__STATIC_FORCEINLINE void rpl_tx_up_dly5_setf(uint16_t txupdly5)
{
    ASSERT_ERR((((uint32_t)txupdly5 << 22) & ~((uint32_t)0xFFC00000)) == 0);
    REG_RPL_WR(RPL_RFTXUP_DLY1_ADDR, (REG_RPL_RD(RPL_RFTXUP_DLY1_ADDR) & ~((uint32_t)0xFFC00000)) | ((uint32_t)txupdly5 << 22));
}

__STATIC_FORCEINLINE uint16_t rpl_tx_up_dly4_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFTXUP_DLY1_ADDR);
    return ((localVal & ((uint32_t)0x001FF800)) >> 11);
}

__STATIC_FORCEINLINE void rpl_tx_up_dly4_setf(uint16_t txupdly4)
{
    ASSERT_ERR((((uint32_t)txupdly4 << 11) & ~((uint32_t)0x001FF800)) == 0);
    REG_RPL_WR(RPL_RFTXUP_DLY1_ADDR, (REG_RPL_RD(RPL_RFTXUP_DLY1_ADDR) & ~((uint32_t)0x001FF800)) | ((uint32_t)txupdly4 << 11));
}

__STATIC_FORCEINLINE uint16_t rpl_tx_up_dly3_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFTXUP_DLY1_ADDR);
    return ((localVal & ((uint32_t)0x000003FF)) >> 0);
}

__STATIC_FORCEINLINE void rpl_tx_up_dly3_setf(uint16_t txupdly3)
{
    ASSERT_ERR((((uint32_t)txupdly3 << 0) & ~((uint32_t)0x000003FF)) == 0);
    REG_RPL_WR(RPL_RFTXUP_DLY1_ADDR, (REG_RPL_RD(RPL_RFTXUP_DLY1_ADDR) & ~((uint32_t)0x000003FF)) | ((uint32_t)txupdly3 << 0));
}

/**
 * @brief RFTXUP_DLY2 register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  31:22           TX_UP_DLY8   0x1
 *  20:11           TX_UP_DLY7   0x1
 *  09:00           TX_UP_DLY6   0x1
 * </pre>
 */
#define RPL_RFTXUP_DLY2_ADDR   0x00000005
#define RPL_RFTXUP_DLY2_OFFSET 0x00000005
#define RPL_RFTXUP_DLY2_INDEX  0x00000005
#define RPL_RFTXUP_DLY2_RESET  0x00400801

__STATIC_FORCEINLINE uint32_t rpl_rftxup_dly2_get(void)
{
    return REG_RPL_RD(RPL_RFTXUP_DLY2_ADDR);
}

__STATIC_FORCEINLINE void rpl_rftxup_dly2_set(uint32_t value)
{
    REG_RPL_WR(RPL_RFTXUP_DLY2_ADDR, value);
}

// field definitions
#define RPL_TX_UP_DLY8_MASK   ((uint32_t)0xFFC00000)
#define RPL_TX_UP_DLY8_LSB    22
#define RPL_TX_UP_DLY8_WIDTH  ((uint32_t)0x0000000A)
#define RPL_TX_UP_DLY7_MASK   ((uint32_t)0x001FF800)
#define RPL_TX_UP_DLY7_LSB    11
#define RPL_TX_UP_DLY7_WIDTH  ((uint32_t)0x0000000A)
#define RPL_TX_UP_DLY6_MASK   ((uint32_t)0x000003FF)
#define RPL_TX_UP_DLY6_LSB    0
#define RPL_TX_UP_DLY6_WIDTH  ((uint32_t)0x0000000A)

#define RPL_TX_UP_DLY8_RST    0x1
#define RPL_TX_UP_DLY7_RST    0x1
#define RPL_TX_UP_DLY6_RST    0x1

__STATIC_FORCEINLINE void rpl_rftxup_dly2_pack(uint16_t txupdly8, uint16_t txupdly7, uint16_t txupdly6)
{
    ASSERT_ERR((((uint32_t)txupdly8 << 22) & ~((uint32_t)0xFFC00000)) == 0);
    ASSERT_ERR((((uint32_t)txupdly7 << 11) & ~((uint32_t)0x001FF800)) == 0);
    ASSERT_ERR((((uint32_t)txupdly6 << 0) & ~((uint32_t)0x000003FF)) == 0);
    REG_RPL_WR(RPL_RFTXUP_DLY2_ADDR,  ((uint32_t)txupdly8 << 22) | ((uint32_t)txupdly7 << 11) | ((uint32_t)txupdly6 << 0));
}

__STATIC_FORCEINLINE void rpl_rftxup_dly2_unpack(uint16_t* txupdly8, uint16_t* txupdly7, uint16_t* txupdly6)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFTXUP_DLY2_ADDR);

    *txupdly8 = (localVal & ((uint32_t)0xFFC00000)) >> 22;
    *txupdly7 = (localVal & ((uint32_t)0x001FF800)) >> 11;
    *txupdly6 = (localVal & ((uint32_t)0x000003FF)) >> 0;
}

__STATIC_FORCEINLINE uint16_t rpl_tx_up_dly8_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFTXUP_DLY2_ADDR);
    return ((localVal & ((uint32_t)0xFFC00000)) >> 22);
}

__STATIC_FORCEINLINE void rpl_tx_up_dly8_setf(uint16_t txupdly8)
{
    ASSERT_ERR((((uint32_t)txupdly8 << 22) & ~((uint32_t)0xFFC00000)) == 0);
    REG_RPL_WR(RPL_RFTXUP_DLY2_ADDR, (REG_RPL_RD(RPL_RFTXUP_DLY2_ADDR) & ~((uint32_t)0xFFC00000)) | ((uint32_t)txupdly8 << 22));
}

__STATIC_FORCEINLINE uint16_t rpl_tx_up_dly7_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFTXUP_DLY2_ADDR);
    return ((localVal & ((uint32_t)0x001FF800)) >> 11);
}

__STATIC_FORCEINLINE void rpl_tx_up_dly7_setf(uint16_t txupdly7)
{
    ASSERT_ERR((((uint32_t)txupdly7 << 11) & ~((uint32_t)0x001FF800)) == 0);
    REG_RPL_WR(RPL_RFTXUP_DLY2_ADDR, (REG_RPL_RD(RPL_RFTXUP_DLY2_ADDR) & ~((uint32_t)0x001FF800)) | ((uint32_t)txupdly7 << 11));
}

__STATIC_FORCEINLINE uint16_t rpl_tx_up_dly6_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFTXUP_DLY2_ADDR);
    return ((localVal & ((uint32_t)0x000003FF)) >> 0);
}

