sriharimaddula/ble-sdk6-examples/SDK_6.0.24.1464/DA145xx_SDK/6.0.24.1464/sdk/platform/driver/ble/reg_ripple.h
__STATIC_FORCEINLINE uint16_t rpl_rx_dn_out6_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_SEQRXDN_OUT2_ADDR);
    return ((localVal & ((uint32_t)0x000001FF)) >> 0);
}

__STATIC_FORCEINLINE void rpl_rx_dn_out6_setf(uint16_t rxdnout6)
{
    ASSERT_ERR((((uint32_t)rxdnout6 << 0) & ~((uint32_t)0x000001FF)) == 0);
    REG_RPL_WR(RPL_SEQRXDN_OUT2_ADDR, (REG_RPL_RD(RPL_SEQRXDN_OUT2_ADDR) & ~((uint32_t)0x000001FF)) | ((uint32_t)rxdnout6 << 0));
}

/**
 * @brief RFSWCNTL register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *     12           TESTMUX_EN   0
 *  09:08         SEL_INPUTBUF   0x0
 *  06:04           SEL_RFSW32   0x0
 *  02:00           SEL_RFSW10   0x0
 * </pre>
 */
#define RPL_RFSWCNTL_ADDR   0x0000001B
#define RPL_RFSWCNTL_OFFSET 0x0000001B
#define RPL_RFSWCNTL_INDEX  0x0000001B
#define RPL_RFSWCNTL_RESET  0x00000000

__STATIC_FORCEINLINE uint32_t rpl_rfswcntl_get(void)
{
    return REG_RPL_RD(RPL_RFSWCNTL_ADDR);
}

__STATIC_FORCEINLINE void rpl_rfswcntl_set(uint32_t value)
{
    REG_RPL_WR(RPL_RFSWCNTL_ADDR, value);
}

// field definitions
#define RPL_TESTMUX_EN_BIT      ((uint32_t)0x00001000)
#define RPL_TESTMUX_EN_POS      12
#define RPL_SEL_INPUTBUF_MASK   ((uint32_t)0x00000300)
#define RPL_SEL_INPUTBUF_LSB    8
#define RPL_SEL_INPUTBUF_WIDTH  ((uint32_t)0x00000002)
#define RPL_SEL_RFSW32_MASK     ((uint32_t)0x00000070)
#define RPL_SEL_RFSW32_LSB      4
#define RPL_SEL_RFSW32_WIDTH    ((uint32_t)0x00000003)
#define RPL_SEL_RFSW10_MASK     ((uint32_t)0x00000007)
#define RPL_SEL_RFSW10_LSB      0
#define RPL_SEL_RFSW10_WIDTH    ((uint32_t)0x00000003)

#define RPL_TESTMUX_EN_RST      0x0
#define RPL_SEL_INPUTBUF_RST    0x0
#define RPL_SEL_RFSW32_RST      0x0
#define RPL_SEL_RFSW10_RST      0x0

__STATIC_FORCEINLINE void rpl_rfswcntl_pack(uint8_t testmuxen, uint8_t selinputbuf, uint8_t selrfsw32, uint8_t selrfsw10)
{
    ASSERT_ERR((((uint32_t)testmuxen << 12) & ~((uint32_t)0x00001000)) == 0);
    ASSERT_ERR((((uint32_t)selinputbuf << 8) & ~((uint32_t)0x00000300)) == 0);
    ASSERT_ERR((((uint32_t)selrfsw32 << 4) & ~((uint32_t)0x00000070)) == 0);
    ASSERT_ERR((((uint32_t)selrfsw10 << 0) & ~((uint32_t)0x00000007)) == 0);
    REG_RPL_WR(RPL_RFSWCNTL_ADDR,  ((uint32_t)testmuxen << 12) | ((uint32_t)selinputbuf << 8) | ((uint32_t)selrfsw32 << 4) | ((uint32_t)selrfsw10 << 0));
}

__STATIC_FORCEINLINE void rpl_rfswcntl_unpack(uint8_t* testmuxen, uint8_t* selinputbuf, uint8_t* selrfsw32, uint8_t* selrfsw10)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFSWCNTL_ADDR);

    *testmuxen = (localVal & ((uint32_t)0x00001000)) >> 12;
    *selinputbuf = (localVal & ((uint32_t)0x00000300)) >> 8;
    *selrfsw32 = (localVal & ((uint32_t)0x00000070)) >> 4;
    *selrfsw10 = (localVal & ((uint32_t)0x00000007)) >> 0;
}

__STATIC_FORCEINLINE uint8_t rpl_testmux_en_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFSWCNTL_ADDR);
    return ((localVal & ((uint32_t)0x00001000)) >> 12);
}

__STATIC_FORCEINLINE void rpl_testmux_en_setf(uint8_t testmuxen)
{
    ASSERT_ERR((((uint32_t)testmuxen << 12) & ~((uint32_t)0x00001000)) == 0);
    REG_RPL_WR(RPL_RFSWCNTL_ADDR, (REG_RPL_RD(RPL_RFSWCNTL_ADDR) & ~((uint32_t)0x00001000)) | ((uint32_t)testmuxen << 12));
}

__STATIC_FORCEINLINE uint8_t rpl_sel_inputbuf_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFSWCNTL_ADDR);
    return ((localVal & ((uint32_t)0x00000300)) >> 8);
}

__STATIC_FORCEINLINE void rpl_sel_inputbuf_setf(uint8_t selinputbuf)
{
    ASSERT_ERR((((uint32_t)selinputbuf << 8) & ~((uint32_t)0x00000300)) == 0);
    REG_RPL_WR(RPL_RFSWCNTL_ADDR, (REG_RPL_RD(RPL_RFSWCNTL_ADDR) & ~((uint32_t)0x00000300)) | ((uint32_t)selinputbuf << 8));
}

__STATIC_FORCEINLINE uint8_t rpl_sel_rfsw32_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFSWCNTL_ADDR);
    return ((localVal & ((uint32_t)0x00000070)) >> 4);
}

__STATIC_FORCEINLINE void rpl_sel_rfsw32_setf(uint8_t selrfsw32)
{
    ASSERT_ERR((((uint32_t)selrfsw32 << 4) & ~((uint32_t)0x00000070)) == 0);
    REG_RPL_WR(RPL_RFSWCNTL_ADDR, (REG_RPL_RD(RPL_RFSWCNTL_ADDR) & ~((uint32_t)0x00000070)) | ((uint32_t)selrfsw32 << 4));
}

__STATIC_FORCEINLINE uint8_t rpl_sel_rfsw10_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFSWCNTL_ADDR);
    return ((localVal & ((uint32_t)0x00000007)) >> 0);
}

__STATIC_FORCEINLINE void rpl_sel_rfsw10_setf(uint8_t selrfsw10)
{
    ASSERT_ERR((((uint32_t)selrfsw10 << 0) & ~((uint32_t)0x00000007)) == 0);
    REG_RPL_WR(RPL_RFSWCNTL_ADDR, (REG_RPL_RD(RPL_RFSWCNTL_ADDR) & ~((uint32_t)0x00000007)) | ((uint32_t)selrfsw10 << 0));
}

/**
 * @brief RPLLCNTL0 register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *     31      FORCE_RPLL_CTRL   0
 *  19:18           RPLL_DELTA   0x0
 *     14              XO32_ON   0
 *  13:12         XO_BIAS_TRIM   0x0
 *     11           XO_TEST_EN   0
 *     10      XO_OPENDRAIN_EN   0
 *     09         XO_REFCLK_EN   0
 *     08                XO_ON   1
 *     05       RPLL_VCOREF_ON   0
 *     04        RPLL_LOCNT_ON   0
 *     03           RPLL_LD_ON   0
 *     02          RPLL_VCO_ON   0
 *     01           RPLL_CP_ON   0
 *     00          RPLL_DIV_ON   0
 * </pre>
 */
#define RPL_RPLLCNTL0_ADDR   0x0000001C
#define RPL_RPLLCNTL0_OFFSET 0x0000001C
#define RPL_RPLLCNTL0_INDEX  0x0000001C
#define RPL_RPLLCNTL0_RESET  0x00000100

__STATIC_FORCEINLINE uint32_t rpl_rpllcntl0_get(void)
{
    return REG_RPL_RD(RPL_RPLLCNTL0_ADDR);
}

__STATIC_FORCEINLINE void rpl_rpllcntl0_set(uint32_t value)
{
    REG_RPL_WR(RPL_RPLLCNTL0_ADDR, value);
}

// field definitions
#define RPL_FORCE_RPLL_CTRL_BIT    ((uint32_t)0x80000000)
#define RPL_FORCE_RPLL_CTRL_POS    31
#define RPL_RPLL_DELTA_MASK        ((uint32_t)0x000C0000)
#define RPL_RPLL_DELTA_LSB         18
#define RPL_RPLL_DELTA_WIDTH       ((uint32_t)0x00000002)
#define RPL_XO32_ON_BIT            ((uint32_t)0x00004000)
#define RPL_XO32_ON_POS            14
#define RPL_XO_BIAS_TRIM_MASK      ((uint32_t)0x00003000)
#define RPL_XO_BIAS_TRIM_LSB       12
#define RPL_XO_BIAS_TRIM_WIDTH     ((uint32_t)0x00000002)
#define RPL_XO_TEST_EN_BIT         ((uint32_t)0x00000800)
#define RPL_XO_TEST_EN_POS         11
#define RPL_XO_OPENDRAIN_EN_BIT    ((uint32_t)0x00000400)
#define RPL_XO_OPENDRAIN_EN_POS    10
#define RPL_XO_REFCLK_EN_BIT       ((uint32_t)0x00000200)
#define RPL_XO_REFCLK_EN_POS       9
#define RPL_XO_ON_BIT              ((uint32_t)0x00000100)
#define RPL_XO_ON_POS              8
#define RPL_RPLL_VCOREF_ON_BIT     ((uint32_t)0x00000020)
#define RPL_RPLL_VCOREF_ON_POS     5
#define RPL_RPLL_LOCNT_ON_BIT      ((uint32_t)0x00000010)
#define RPL_RPLL_LOCNT_ON_POS      4
#define RPL_RPLL_LD_ON_BIT         ((uint32_t)0x00000008)
#define RPL_RPLL_LD_ON_POS         3
#define RPL_RPLL_VCO_ON_BIT        ((uint32_t)0x00000004)
#define RPL_RPLL_VCO_ON_POS        2
#define RPL_RPLL_CP_ON_BIT         ((uint32_t)0x00000002)
#define RPL_RPLL_CP_ON_POS         1
#define RPL_RPLL_DIV_ON_BIT        ((uint32_t)0x00000001)
#define RPL_RPLL_DIV_ON_POS        0

