sriharimaddula/ble-sdk6-examples/SDK_6.0.24.1464/DA145xx_SDK/6.0.24.1464/sdk/platform/driver/ble/reg_ripple.h
#define RPL_FORCE_RPLL_CTRL_RST    0x0
#define RPL_RPLL_DELTA_RST         0x0
#define RPL_XO32_ON_RST            0x0
#define RPL_XO_BIAS_TRIM_RST       0x0
#define RPL_XO_TEST_EN_RST         0x0
#define RPL_XO_OPENDRAIN_EN_RST    0x0
#define RPL_XO_REFCLK_EN_RST       0x0
#define RPL_XO_ON_RST              0x1
#define RPL_RPLL_VCOREF_ON_RST     0x0
#define RPL_RPLL_LOCNT_ON_RST      0x0
#define RPL_RPLL_LD_ON_RST         0x0
#define RPL_RPLL_VCO_ON_RST        0x0
#define RPL_RPLL_CP_ON_RST         0x0
#define RPL_RPLL_DIV_ON_RST        0x0

__STATIC_FORCEINLINE void rpl_rpllcntl0_pack(uint8_t forcerpllctrl, uint8_t rplldelta, uint8_t xo32on, uint8_t xobiastrim, uint8_t xotesten, uint8_t xoopendrainen, uint8_t xorefclken, uint8_t xoon, uint8_t rpllvcorefon, uint8_t rplllocnton, uint8_t rpllldon, uint8_t rpllvcoon, uint8_t rpllcpon, uint8_t rplldivon)
{
    ASSERT_ERR((((uint32_t)forcerpllctrl << 31) & ~((uint32_t)0x80000000)) == 0);
    ASSERT_ERR((((uint32_t)rplldelta << 18) & ~((uint32_t)0x000C0000)) == 0);
    ASSERT_ERR((((uint32_t)xo32on << 14) & ~((uint32_t)0x00004000)) == 0);
    ASSERT_ERR((((uint32_t)xobiastrim << 12) & ~((uint32_t)0x00003000)) == 0);
    ASSERT_ERR((((uint32_t)xotesten << 11) & ~((uint32_t)0x00000800)) == 0);
    ASSERT_ERR((((uint32_t)xoopendrainen << 10) & ~((uint32_t)0x00000400)) == 0);
    ASSERT_ERR((((uint32_t)xorefclken << 9) & ~((uint32_t)0x00000200)) == 0);
    ASSERT_ERR((((uint32_t)xoon << 8) & ~((uint32_t)0x00000100)) == 0);
    ASSERT_ERR((((uint32_t)rpllvcorefon << 5) & ~((uint32_t)0x00000020)) == 0);
    ASSERT_ERR((((uint32_t)rplllocnton << 4) & ~((uint32_t)0x00000010)) == 0);
    ASSERT_ERR((((uint32_t)rpllldon << 3) & ~((uint32_t)0x00000008)) == 0);
    ASSERT_ERR((((uint32_t)rpllvcoon << 2) & ~((uint32_t)0x00000004)) == 0);
    ASSERT_ERR((((uint32_t)rpllcpon << 1) & ~((uint32_t)0x00000002)) == 0);
    ASSERT_ERR((((uint32_t)rplldivon << 0) & ~((uint32_t)0x00000001)) == 0);
    REG_RPL_WR(RPL_RPLLCNTL0_ADDR,  ((uint32_t)forcerpllctrl << 31) | ((uint32_t)rplldelta << 18) | ((uint32_t)xo32on << 14) | ((uint32_t)xobiastrim << 12) | ((uint32_t)xotesten << 11) | ((uint32_t)xoopendrainen << 10) | ((uint32_t)xorefclken << 9) | ((uint32_t)xoon << 8) | ((uint32_t)rpllvcorefon << 5) | ((uint32_t)rplllocnton << 4) | ((uint32_t)rpllldon << 3) | ((uint32_t)rpllvcoon << 2) | ((uint32_t)rpllcpon << 1) | ((uint32_t)rplldivon << 0));
}

__STATIC_FORCEINLINE void rpl_rpllcntl0_unpack(uint8_t* forcerpllctrl, uint8_t* rplldelta, uint8_t* xo32on, uint8_t* xobiastrim, uint8_t* xotesten, uint8_t* xoopendrainen, uint8_t* xorefclken, uint8_t* xoon, uint8_t* rpllvcorefon, uint8_t* rplllocnton, uint8_t* rpllldon, uint8_t* rpllvcoon, uint8_t* rpllcpon, uint8_t* rplldivon)
{
    uint32_t localVal = REG_RPL_RD(RPL_RPLLCNTL0_ADDR);

    *forcerpllctrl = (localVal & ((uint32_t)0x80000000)) >> 31;
    *rplldelta = (localVal & ((uint32_t)0x000C0000)) >> 18;
    *xo32on = (localVal & ((uint32_t)0x00004000)) >> 14;
    *xobiastrim = (localVal & ((uint32_t)0x00003000)) >> 12;
    *xotesten = (localVal & ((uint32_t)0x00000800)) >> 11;
    *xoopendrainen = (localVal & ((uint32_t)0x00000400)) >> 10;
    *xorefclken = (localVal & ((uint32_t)0x00000200)) >> 9;
    *xoon = (localVal & ((uint32_t)0x00000100)) >> 8;
    *rpllvcorefon = (localVal & ((uint32_t)0x00000020)) >> 5;
    *rplllocnton = (localVal & ((uint32_t)0x00000010)) >> 4;
    *rpllldon = (localVal & ((uint32_t)0x00000008)) >> 3;
    *rpllvcoon = (localVal & ((uint32_t)0x00000004)) >> 2;
    *rpllcpon = (localVal & ((uint32_t)0x00000002)) >> 1;
    *rplldivon = (localVal & ((uint32_t)0x00000001)) >> 0;
}

__STATIC_FORCEINLINE uint8_t rpl_force_rpll_ctrl_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RPLLCNTL0_ADDR);
    return ((localVal & ((uint32_t)0x80000000)) >> 31);
}

__STATIC_FORCEINLINE void rpl_force_rpll_ctrl_setf(uint8_t forcerpllctrl)
{
    ASSERT_ERR((((uint32_t)forcerpllctrl << 31) & ~((uint32_t)0x80000000)) == 0);
    REG_RPL_WR(RPL_RPLLCNTL0_ADDR, (REG_RPL_RD(RPL_RPLLCNTL0_ADDR) & ~((uint32_t)0x80000000)) | ((uint32_t)forcerpllctrl << 31));
}

__STATIC_FORCEINLINE uint8_t rpl_rpll_delta_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RPLLCNTL0_ADDR);
    return ((localVal & ((uint32_t)0x000C0000)) >> 18);
}

__STATIC_FORCEINLINE void rpl_rpll_delta_setf(uint8_t rplldelta)
{
    ASSERT_ERR((((uint32_t)rplldelta << 18) & ~((uint32_t)0x000C0000)) == 0);
    REG_RPL_WR(RPL_RPLLCNTL0_ADDR, (REG_RPL_RD(RPL_RPLLCNTL0_ADDR) & ~((uint32_t)0x000C0000)) | ((uint32_t)rplldelta << 18));
}

__STATIC_FORCEINLINE uint8_t rpl_xo32_on_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RPLLCNTL0_ADDR);
    return ((localVal & ((uint32_t)0x00004000)) >> 14);
}

__STATIC_FORCEINLINE void rpl_xo32_on_setf(uint8_t xo32on)
{
    ASSERT_ERR((((uint32_t)xo32on << 14) & ~((uint32_t)0x00004000)) == 0);
    REG_RPL_WR(RPL_RPLLCNTL0_ADDR, (REG_RPL_RD(RPL_RPLLCNTL0_ADDR) & ~((uint32_t)0x00004000)) | ((uint32_t)xo32on << 14));
}

__STATIC_FORCEINLINE uint8_t rpl_xo_bias_trim_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RPLLCNTL0_ADDR);
    return ((localVal & ((uint32_t)0x00003000)) >> 12);
}

__STATIC_FORCEINLINE void rpl_xo_bias_trim_setf(uint8_t xobiastrim)
{
    ASSERT_ERR((((uint32_t)xobiastrim << 12) & ~((uint32_t)0x00003000)) == 0);
    REG_RPL_WR(RPL_RPLLCNTL0_ADDR, (REG_RPL_RD(RPL_RPLLCNTL0_ADDR) & ~((uint32_t)0x00003000)) | ((uint32_t)xobiastrim << 12));
}

__STATIC_FORCEINLINE uint8_t rpl_xo_test_en_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RPLLCNTL0_ADDR);
    return ((localVal & ((uint32_t)0x00000800)) >> 11);
}

__STATIC_FORCEINLINE void rpl_xo_test_en_setf(uint8_t xotesten)
{
    ASSERT_ERR((((uint32_t)xotesten << 11) & ~((uint32_t)0x00000800)) == 0);
    REG_RPL_WR(RPL_RPLLCNTL0_ADDR, (REG_RPL_RD(RPL_RPLLCNTL0_ADDR) & ~((uint32_t)0x00000800)) | ((uint32_t)xotesten << 11));
}

__STATIC_FORCEINLINE uint8_t rpl_xo_opendrain_en_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RPLLCNTL0_ADDR);
    return ((localVal & ((uint32_t)0x00000400)) >> 10);
}

__STATIC_FORCEINLINE void rpl_xo_opendrain_en_setf(uint8_t xoopendrainen)
{
    ASSERT_ERR((((uint32_t)xoopendrainen << 10) & ~((uint32_t)0x00000400)) == 0);
    REG_RPL_WR(RPL_RPLLCNTL0_ADDR, (REG_RPL_RD(RPL_RPLLCNTL0_ADDR) & ~((uint32_t)0x00000400)) | ((uint32_t)xoopendrainen << 10));
}

__STATIC_FORCEINLINE uint8_t rpl_xo_refclk_en_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RPLLCNTL0_ADDR);
    return ((localVal & ((uint32_t)0x00000200)) >> 9);
}

__STATIC_FORCEINLINE void rpl_xo_refclk_en_setf(uint8_t xorefclken)
{
    ASSERT_ERR((((uint32_t)xorefclken << 9) & ~((uint32_t)0x00000200)) == 0);
    REG_RPL_WR(RPL_RPLLCNTL0_ADDR, (REG_RPL_RD(RPL_RPLLCNTL0_ADDR) & ~((uint32_t)0x00000200)) | ((uint32_t)xorefclken << 9));
}

__STATIC_FORCEINLINE uint8_t rpl_xo_on_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RPLLCNTL0_ADDR);
    return ((localVal & ((uint32_t)0x00000100)) >> 8);
}

