sriharimaddula/ble-sdk6-examples/SDK_6.0.24.1464/DA145xx_SDK/6.0.24.1464/sdk/platform/driver/ble/reg_ripple.h
__STATIC_FORCEINLINE void rpl_mash_sdi2_setf(uint8_t mashsdi2)
{
    ASSERT_ERR((((uint32_t)mashsdi2 << 8) & ~((uint32_t)0x0000FF00)) == 0);
    REG_RPL_WR(RPL_RPLLMASH_INIT_ADDR, (REG_RPL_RD(RPL_RPLLMASH_INIT_ADDR) & ~((uint32_t)0x0000FF00)) | ((uint32_t)mashsdi2 << 8));
}

__STATIC_FORCEINLINE uint8_t rpl_mash_sdi1_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RPLLMASH_INIT_ADDR);
    return ((localVal & ((uint32_t)0x000000FF)) >> 0);
}

__STATIC_FORCEINLINE void rpl_mash_sdi1_setf(uint8_t mashsdi1)
{
    ASSERT_ERR((((uint32_t)mashsdi1 << 0) & ~((uint32_t)0x000000FF)) == 0);
    REG_RPL_WR(RPL_RPLLMASH_INIT_ADDR, (REG_RPL_RD(RPL_RPLLMASH_INIT_ADDR) & ~((uint32_t)0x000000FF)) | ((uint32_t)mashsdi1 << 0));
}

/**
 * @brief GFSK_FILT_COEFF register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  31:00           FILT_COEFF   0x543C1702
 * </pre>
 */
#define RPL_GFSK_FILT_COEFF_ADDR   0x00000025
#define RPL_GFSK_FILT_COEFF_OFFSET 0x00000025
#define RPL_GFSK_FILT_COEFF_INDEX  0x00000025
#define RPL_GFSK_FILT_COEFF_RESET  0x543C1702
#define RPL_GFSK_FILT_COEFF_COUNT  13

__STATIC_FORCEINLINE uint32_t rpl_gfsk_filt_coeff_get(int reg_idx)
{
    ASSERT_ERR(reg_idx <= 12);
    return REG_RPL_RD(RPL_GFSK_FILT_COEFF_ADDR + reg_idx * 1);
}

__STATIC_FORCEINLINE void rpl_gfsk_filt_coeff_set(int reg_idx, uint32_t value)
{
    ASSERT_ERR(reg_idx <= 12);
    REG_RPL_WR(RPL_GFSK_FILT_COEFF_ADDR + reg_idx * 1, value);
}

// field definitions
#define RPL_FILT_COEFF_MASK   ((uint32_t)0xFFFFFFFF)
#define RPL_FILT_COEFF_LSB    0
#define RPL_FILT_COEFF_WIDTH  ((uint32_t)0x00000020)

#define RPL_FILT_COEFF_RST    0x543C1702

__STATIC_FORCEINLINE uint32_t rpl_filt_coeff_getf(int reg_idx)
{
    ASSERT_ERR(reg_idx <= 12);
    uint32_t localVal = REG_RPL_RD(RPL_GFSK_FILT_COEFF_ADDR + reg_idx * 1);
    ASSERT_ERR((localVal & ~((uint32_t)0xFFFFFFFF)) == 0);
    return (localVal >> 0);
}

__STATIC_FORCEINLINE void rpl_filt_coeff_setf(int reg_idx, uint32_t filtcoeff)
{
    ASSERT_ERR(reg_idx <= 12);
    ASSERT_ERR((((uint32_t)filtcoeff << 0) & ~((uint32_t)0xFFFFFFFF)) == 0);
    REG_RPL_WR(RPL_GFSK_FILT_COEFF_ADDR + reg_idx * 1, (uint32_t)filtcoeff << 0);
}

/**
 * @brief DPLLCNTL0 register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *     31      FORCE_DPLL_CTRL   0
 *     03           DPLL_LD_ON   0
 *     02          DPLL_VCO_ON   0
 *     01           DPLL_CP_ON   0
 * </pre>
 */
#define RPL_DPLLCNTL0_ADDR   0x00000032
#define RPL_DPLLCNTL0_OFFSET 0x00000032
#define RPL_DPLLCNTL0_INDEX  0x00000032
#define RPL_DPLLCNTL0_RESET  0x00000000

__STATIC_FORCEINLINE uint32_t rpl_dpllcntl0_get(void)
{
    return REG_RPL_RD(RPL_DPLLCNTL0_ADDR);
}

__STATIC_FORCEINLINE void rpl_dpllcntl0_set(uint32_t value)
{
    REG_RPL_WR(RPL_DPLLCNTL0_ADDR, value);
}

// field definitions
#define RPL_FORCE_DPLL_CTRL_BIT    ((uint32_t)0x80000000)
#define RPL_FORCE_DPLL_CTRL_POS    31
#define RPL_DPLL_LD_ON_BIT         ((uint32_t)0x00000008)
#define RPL_DPLL_LD_ON_POS         3
#define RPL_DPLL_VCO_ON_BIT        ((uint32_t)0x00000004)
#define RPL_DPLL_VCO_ON_POS        2
#define RPL_DPLL_CP_ON_BIT         ((uint32_t)0x00000002)
#define RPL_DPLL_CP_ON_POS         1

#define RPL_FORCE_DPLL_CTRL_RST    0x0
#define RPL_DPLL_LD_ON_RST         0x0
#define RPL_DPLL_VCO_ON_RST        0x0
#define RPL_DPLL_CP_ON_RST         0x0

__STATIC_FORCEINLINE void rpl_dpllcntl0_pack(uint8_t forcedpllctrl, uint8_t dpllldon, uint8_t dpllvcoon, uint8_t dpllcpon)
{
    ASSERT_ERR((((uint32_t)forcedpllctrl << 31) & ~((uint32_t)0x80000000)) == 0);
    ASSERT_ERR((((uint32_t)dpllldon << 3) & ~((uint32_t)0x00000008)) == 0);
    ASSERT_ERR((((uint32_t)dpllvcoon << 2) & ~((uint32_t)0x00000004)) == 0);
    ASSERT_ERR((((uint32_t)dpllcpon << 1) & ~((uint32_t)0x00000002)) == 0);
    REG_RPL_WR(RPL_DPLLCNTL0_ADDR,  ((uint32_t)forcedpllctrl << 31) | ((uint32_t)dpllldon << 3) | ((uint32_t)dpllvcoon << 2) | ((uint32_t)dpllcpon << 1));
}

__STATIC_FORCEINLINE void rpl_dpllcntl0_unpack(uint8_t* forcedpllctrl, uint8_t* dpllldon, uint8_t* dpllvcoon, uint8_t* dpllcpon)
{
    uint32_t localVal = REG_RPL_RD(RPL_DPLLCNTL0_ADDR);

    *forcedpllctrl = (localVal & ((uint32_t)0x80000000)) >> 31;
    *dpllldon = (localVal & ((uint32_t)0x00000008)) >> 3;
    *dpllvcoon = (localVal & ((uint32_t)0x00000004)) >> 2;
    *dpllcpon = (localVal & ((uint32_t)0x00000002)) >> 1;
}

__STATIC_FORCEINLINE uint8_t rpl_force_dpll_ctrl_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_DPLLCNTL0_ADDR);
    return ((localVal & ((uint32_t)0x80000000)) >> 31);
}

__STATIC_FORCEINLINE void rpl_force_dpll_ctrl_setf(uint8_t forcedpllctrl)
{
    ASSERT_ERR((((uint32_t)forcedpllctrl << 31) & ~((uint32_t)0x80000000)) == 0);
    REG_RPL_WR(RPL_DPLLCNTL0_ADDR, (REG_RPL_RD(RPL_DPLLCNTL0_ADDR) & ~((uint32_t)0x80000000)) | ((uint32_t)forcedpllctrl << 31));
}

__STATIC_FORCEINLINE uint8_t rpl_dpll_ld_on_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_DPLLCNTL0_ADDR);
    return ((localVal & ((uint32_t)0x00000008)) >> 3);
}

__STATIC_FORCEINLINE void rpl_dpll_ld_on_setf(uint8_t dpllldon)
{
    ASSERT_ERR((((uint32_t)dpllldon << 3) & ~((uint32_t)0x00000008)) == 0);
    REG_RPL_WR(RPL_DPLLCNTL0_ADDR, (REG_RPL_RD(RPL_DPLLCNTL0_ADDR) & ~((uint32_t)0x00000008)) | ((uint32_t)dpllldon << 3));
}

__STATIC_FORCEINLINE uint8_t rpl_dpll_vco_on_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_DPLLCNTL0_ADDR);
    return ((localVal & ((uint32_t)0x00000004)) >> 2);
}

__STATIC_FORCEINLINE void rpl_dpll_vco_on_setf(uint8_t dpllvcoon)
{
    ASSERT_ERR((((uint32_t)dpllvcoon << 2) & ~((uint32_t)0x00000004)) == 0);
    REG_RPL_WR(RPL_DPLLCNTL0_ADDR, (REG_RPL_RD(RPL_DPLLCNTL0_ADDR) & ~((uint32_t)0x00000004)) | ((uint32_t)dpllvcoon << 2));
}

__STATIC_FORCEINLINE uint8_t rpl_dpll_cp_on_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_DPLLCNTL0_ADDR);
    return ((localVal & ((uint32_t)0x00000002)) >> 1);
}

__STATIC_FORCEINLINE void rpl_dpll_cp_on_setf(uint8_t dpllcpon)
{
    ASSERT_ERR((((uint32_t)dpllcpon << 1) & ~((uint32_t)0x00000002)) == 0);
    REG_RPL_WR(RPL_DPLLCNTL0_ADDR, (REG_RPL_RD(RPL_DPLLCNTL0_ADDR) & ~((uint32_t)0x00000002)) | ((uint32_t)dpllcpon << 1));
}

/**
 * @brief DPLLCNTL1 register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  29:28            DPLL_DIVR   0x0
 *  26:24            DPLL_DIVP   0x0
 *  23:08          DPLL_NFRACT   0x0
 *  04:00            DPLL_NINT   0x0
 * </pre>
 */
#define RPL_DPLLCNTL1_ADDR   0x00000033
#define RPL_DPLLCNTL1_OFFSET 0x00000033
#define RPL_DPLLCNTL1_INDEX  0x00000033
#define RPL_DPLLCNTL1_RESET  0x00000000

__STATIC_FORCEINLINE uint32_t rpl_dpllcntl1_get(void)
{
    return REG_RPL_RD(RPL_DPLLCNTL1_ADDR);
}

__STATIC_FORCEINLINE void rpl_dpllcntl1_set(uint32_t value)
{
    REG_RPL_WR(RPL_DPLLCNTL1_ADDR, value);
}

