sriharimaddula/ble-sdk6-examples/SDK_6.0.24.1464/DA145xx_SDK/6.0.24.1464/sdk/platform/driver/ble/reg_ripple.h
#define RPL_LUT_TXDCQ_8DPSK_VAL_RST    0x0
#define RPL_LUT_TXDCI_8DPSK_VAL_RST    0x0
#define RPL_LUT_TXDCQ_DQPSK_VAL_RST    0x0
#define RPL_LUT_TXDCI_DQPSK_VAL_RST    0x0
#define RPL_LUT_TXDCQ_GFSK_VAL_RST     0x0
#define RPL_LUT_TXDCI_GFSK_VAL_RST     0x0

__STATIC_FORCEINLINE void rpl_txdc_calibstat_unpack(uint8_t* luttxdcq8dpskval, uint8_t* luttxdci8dpskval, uint8_t* luttxdcqdqpskval, uint8_t* luttxdcidqpskval, uint8_t* luttxdcqgfskval, uint8_t* luttxdcigfskval)
{
    uint32_t localVal = REG_RPL_RD(RPL_TXDC_CALIBSTAT_ADDR);

    *luttxdcq8dpskval = (localVal & ((uint32_t)0x3E000000)) >> 25;
    *luttxdci8dpskval = (localVal & ((uint32_t)0x01F00000)) >> 20;
    *luttxdcqdqpskval = (localVal & ((uint32_t)0x000F8000)) >> 15;
    *luttxdcidqpskval = (localVal & ((uint32_t)0x00007C00)) >> 10;
    *luttxdcqgfskval = (localVal & ((uint32_t)0x000003E0)) >> 5;
    *luttxdcigfskval = (localVal & ((uint32_t)0x0000001F)) >> 0;
}

__STATIC_FORCEINLINE uint8_t rpl_lut_txdcq_8dpsk_val_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_TXDC_CALIBSTAT_ADDR);
    return ((localVal & ((uint32_t)0x3E000000)) >> 25);
}

__STATIC_FORCEINLINE uint8_t rpl_lut_txdci_8dpsk_val_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_TXDC_CALIBSTAT_ADDR);
    return ((localVal & ((uint32_t)0x01F00000)) >> 20);
}

__STATIC_FORCEINLINE uint8_t rpl_lut_txdcq_dqpsk_val_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_TXDC_CALIBSTAT_ADDR);
    return ((localVal & ((uint32_t)0x000F8000)) >> 15);
}

__STATIC_FORCEINLINE uint8_t rpl_lut_txdci_dqpsk_val_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_TXDC_CALIBSTAT_ADDR);
    return ((localVal & ((uint32_t)0x00007C00)) >> 10);
}

__STATIC_FORCEINLINE uint8_t rpl_lut_txdcq_gfsk_val_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_TXDC_CALIBSTAT_ADDR);
    return ((localVal & ((uint32_t)0x000003E0)) >> 5);
}

__STATIC_FORCEINLINE uint8_t rpl_lut_txdci_gfsk_val_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_TXDC_CALIBSTAT_ADDR);
    return ((localVal & ((uint32_t)0x0000001F)) >> 0);
}

/**
 * @brief AGC_RSSI_CONFIG register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *     31    RXAGC_SATDET_MODE   1
 *  16:12     RSSI_PRELOAD_CNT   0x0
 *  11:08     RSSI_ON_DLYD_CNT   0x0
 *  07:00      AGC_SETTLE_TIME   0x40
 * </pre>
 */
#define RPL_AGC_RSSI_CONFIG_ADDR   0x0000003F
#define RPL_AGC_RSSI_CONFIG_OFFSET 0x0000003F
#define RPL_AGC_RSSI_CONFIG_INDEX  0x0000003F
#define RPL_AGC_RSSI_CONFIG_RESET  0x80000040

__STATIC_FORCEINLINE uint32_t rpl_agc_rssi_config_get(void)
{
    return REG_RPL_RD(RPL_AGC_RSSI_CONFIG_ADDR);
}

__STATIC_FORCEINLINE void rpl_agc_rssi_config_set(uint32_t value)
{
    REG_RPL_WR(RPL_AGC_RSSI_CONFIG_ADDR, value);
}

// field definitions
#define RPL_RXAGC_SATDET_MODE_BIT    ((uint32_t)0x80000000)
#define RPL_RXAGC_SATDET_MODE_POS    31
#define RPL_RSSI_PRELOAD_CNT_MASK    ((uint32_t)0x0001F000)
#define RPL_RSSI_PRELOAD_CNT_LSB     12
#define RPL_RSSI_PRELOAD_CNT_WIDTH   ((uint32_t)0x00000005)
#define RPL_RSSI_ON_DLYD_CNT_MASK    ((uint32_t)0x00000F00)
#define RPL_RSSI_ON_DLYD_CNT_LSB     8
#define RPL_RSSI_ON_DLYD_CNT_WIDTH   ((uint32_t)0x00000004)
#define RPL_AGC_SETTLE_TIME_MASK     ((uint32_t)0x000000FF)
#define RPL_AGC_SETTLE_TIME_LSB      0
#define RPL_AGC_SETTLE_TIME_WIDTH    ((uint32_t)0x00000008)

#define RPL_RXAGC_SATDET_MODE_RST    0x1
#define RPL_RSSI_PRELOAD_CNT_RST     0x0
#define RPL_RSSI_ON_DLYD_CNT_RST     0x0
#define RPL_AGC_SETTLE_TIME_RST      0x40

__STATIC_FORCEINLINE void rpl_agc_rssi_config_pack(uint8_t rxagcsatdetmode, uint8_t rssipreloadcnt, uint8_t rssiondlydcnt, uint8_t agcsettletime)
{
    ASSERT_ERR((((uint32_t)rxagcsatdetmode << 31) & ~((uint32_t)0x80000000)) == 0);
    ASSERT_ERR((((uint32_t)rssipreloadcnt << 12) & ~((uint32_t)0x0001F000)) == 0);
    ASSERT_ERR((((uint32_t)rssiondlydcnt << 8) & ~((uint32_t)0x00000F00)) == 0);
    ASSERT_ERR((((uint32_t)agcsettletime << 0) & ~((uint32_t)0x000000FF)) == 0);
    REG_RPL_WR(RPL_AGC_RSSI_CONFIG_ADDR,  ((uint32_t)rxagcsatdetmode << 31) | ((uint32_t)rssipreloadcnt << 12) | ((uint32_t)rssiondlydcnt << 8) | ((uint32_t)agcsettletime << 0));
}

__STATIC_FORCEINLINE void rpl_agc_rssi_config_unpack(uint8_t* rxagcsatdetmode, uint8_t* rssipreloadcnt, uint8_t* rssiondlydcnt, uint8_t* agcsettletime)
{
    uint32_t localVal = REG_RPL_RD(RPL_AGC_RSSI_CONFIG_ADDR);

    *rxagcsatdetmode = (localVal & ((uint32_t)0x80000000)) >> 31;
    *rssipreloadcnt = (localVal & ((uint32_t)0x0001F000)) >> 12;
    *rssiondlydcnt = (localVal & ((uint32_t)0x00000F00)) >> 8;
    *agcsettletime = (localVal & ((uint32_t)0x000000FF)) >> 0;
}

__STATIC_FORCEINLINE uint8_t rpl_rxagc_satdet_mode_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_AGC_RSSI_CONFIG_ADDR);
    return ((localVal & ((uint32_t)0x80000000)) >> 31);
}

__STATIC_FORCEINLINE void rpl_rxagc_satdet_mode_setf(uint8_t rxagcsatdetmode)
{
    ASSERT_ERR((((uint32_t)rxagcsatdetmode << 31) & ~((uint32_t)0x80000000)) == 0);
    REG_RPL_WR(RPL_AGC_RSSI_CONFIG_ADDR, (REG_RPL_RD(RPL_AGC_RSSI_CONFIG_ADDR) & ~((uint32_t)0x80000000)) | ((uint32_t)rxagcsatdetmode << 31));
}

__STATIC_FORCEINLINE uint8_t rpl_rssi_preload_cnt_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_AGC_RSSI_CONFIG_ADDR);
    return ((localVal & ((uint32_t)0x0001F000)) >> 12);
}

__STATIC_FORCEINLINE void rpl_rssi_preload_cnt_setf(uint8_t rssipreloadcnt)
{
    ASSERT_ERR((((uint32_t)rssipreloadcnt << 12) & ~((uint32_t)0x0001F000)) == 0);
    REG_RPL_WR(RPL_AGC_RSSI_CONFIG_ADDR, (REG_RPL_RD(RPL_AGC_RSSI_CONFIG_ADDR) & ~((uint32_t)0x0001F000)) | ((uint32_t)rssipreloadcnt << 12));
}

__STATIC_FORCEINLINE uint8_t rpl_rssi_on_dlyd_cnt_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_AGC_RSSI_CONFIG_ADDR);
    return ((localVal & ((uint32_t)0x00000F00)) >> 8);
}

__STATIC_FORCEINLINE void rpl_rssi_on_dlyd_cnt_setf(uint8_t rssiondlydcnt)
{
    ASSERT_ERR((((uint32_t)rssiondlydcnt << 8) & ~((uint32_t)0x00000F00)) == 0);
    REG_RPL_WR(RPL_AGC_RSSI_CONFIG_ADDR, (REG_RPL_RD(RPL_AGC_RSSI_CONFIG_ADDR) & ~((uint32_t)0x00000F00)) | ((uint32_t)rssiondlydcnt << 8));
}

__STATIC_FORCEINLINE uint8_t rpl_agc_settle_time_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_AGC_RSSI_CONFIG_ADDR);
    return ((localVal & ((uint32_t)0x000000FF)) >> 0);
}

__STATIC_FORCEINLINE void rpl_agc_settle_time_setf(uint8_t agcsettletime)
{
    ASSERT_ERR((((uint32_t)agcsettletime << 0) & ~((uint32_t)0x000000FF)) == 0);
    REG_RPL_WR(RPL_AGC_RSSI_CONFIG_ADDR, (REG_RPL_RD(RPL_AGC_RSSI_CONFIG_ADDR) & ~((uint32_t)0x000000FF)) | ((uint32_t)agcsettletime << 0));
}

/**
 * @brief AGC_STAT register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  02:00           AGC_RXGAIN   0x0
 * </pre>
 */
#define RPL_AGC_STAT_ADDR   0x00000040
#define RPL_AGC_STAT_OFFSET 0x00000040
#define RPL_AGC_STAT_INDEX  0x00000040
#define RPL_AGC_STAT_RESET  0x00000000

__STATIC_FORCEINLINE uint32_t rpl_agc_stat_get(void)
{
    return REG_RPL_RD(RPL_AGC_STAT_ADDR);
}

