sriharimaddula/ble-sdk6-examples/SDK_6.0.24.1464/DA145xx_SDK/6.0.24.1464/sdk/platform/driver/ble/reg_ripple.h
// field definitions
#define RPL_AGC_RXGAIN_MASK   ((uint32_t)0x00000007)
#define RPL_AGC_RXGAIN_LSB    0
#define RPL_AGC_RXGAIN_WIDTH  ((uint32_t)0x00000003)

#define RPL_AGC_RXGAIN_RST    0x0

__STATIC_FORCEINLINE uint8_t rpl_agc_rxgain_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_AGC_STAT_ADDR);
    ASSERT_ERR((localVal & ~((uint32_t)0x00000007)) == 0);
    return (localVal >> 0);
}

/**
 * @brief RFRXGAINTABLE register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  09:08           RXLNA_GAIN   0x3
 *  05:04           RXMIX_GAIN   0x3
 *  02:00        RXFILTER_GAIN   0x7
 * </pre>
 */
#define RPL_RFRXGAINTABLE_ADDR   0x00000041
#define RPL_RFRXGAINTABLE_OFFSET 0x00000041
#define RPL_RFRXGAINTABLE_INDEX  0x00000041
#define RPL_RFRXGAINTABLE_RESET  0x00000337
#define RPL_RFRXGAINTABLE_COUNT  7

__STATIC_FORCEINLINE uint32_t rpl_rfrxgaintable_get(int reg_idx)
{
    ASSERT_ERR(reg_idx <= 6);
    return REG_RPL_RD(RPL_RFRXGAINTABLE_ADDR + reg_idx * 1);
}

__STATIC_FORCEINLINE void rpl_rfrxgaintable_set(int reg_idx, uint32_t value)
{
    ASSERT_ERR(reg_idx <= 6);
    REG_RPL_WR(RPL_RFRXGAINTABLE_ADDR + reg_idx * 1, value);
}

// field definitions
#define RPL_RXLNA_GAIN_MASK      ((uint32_t)0x00000300)
#define RPL_RXLNA_GAIN_LSB       8
#define RPL_RXLNA_GAIN_WIDTH     ((uint32_t)0x00000002)
#define RPL_RXMIX_GAIN_MASK      ((uint32_t)0x00000030)
#define RPL_RXMIX_GAIN_LSB       4
#define RPL_RXMIX_GAIN_WIDTH     ((uint32_t)0x00000002)
#define RPL_RXFILTER_GAIN_MASK   ((uint32_t)0x00000007)
#define RPL_RXFILTER_GAIN_LSB    0
#define RPL_RXFILTER_GAIN_WIDTH  ((uint32_t)0x00000003)

#define RPL_RXLNA_GAIN_RST       0x3
#define RPL_RXMIX_GAIN_RST       0x3
#define RPL_RXFILTER_GAIN_RST    0x7

__STATIC_FORCEINLINE void rpl_rfrxgaintable_pack(int reg_idx, uint8_t rxlnagain, uint8_t rxmixgain, uint8_t rxfiltergain)
{
    ASSERT_ERR(reg_idx <= 6);
    ASSERT_ERR((((uint32_t)rxlnagain << 8) & ~((uint32_t)0x00000300)) == 0);
    ASSERT_ERR((((uint32_t)rxmixgain << 4) & ~((uint32_t)0x00000030)) == 0);
    ASSERT_ERR((((uint32_t)rxfiltergain << 0) & ~((uint32_t)0x00000007)) == 0);
    REG_RPL_WR(RPL_RFRXGAINTABLE_ADDR + reg_idx * 1,  ((uint32_t)rxlnagain << 8) | ((uint32_t)rxmixgain << 4) | ((uint32_t)rxfiltergain << 0));
}

__STATIC_FORCEINLINE void rpl_rfrxgaintable_unpack(int reg_idx, uint8_t* rxlnagain, uint8_t* rxmixgain, uint8_t* rxfiltergain)
{
    ASSERT_ERR(reg_idx <= 6);
    uint32_t localVal = REG_RPL_RD(RPL_RFRXGAINTABLE_ADDR + reg_idx * 1);

    *rxlnagain = (localVal & ((uint32_t)0x00000300)) >> 8;
    *rxmixgain = (localVal & ((uint32_t)0x00000030)) >> 4;
    *rxfiltergain = (localVal & ((uint32_t)0x00000007)) >> 0;
}

__STATIC_FORCEINLINE uint8_t rpl_rxlna_gain_getf(int reg_idx)
{
    ASSERT_ERR(reg_idx <= 6);
    uint32_t localVal = REG_RPL_RD(RPL_RFRXGAINTABLE_ADDR + reg_idx * 1);
    return ((localVal & ((uint32_t)0x00000300)) >> 8);
}

__STATIC_FORCEINLINE void rpl_rxlna_gain_setf(int reg_idx, uint8_t rxlnagain)
{
    ASSERT_ERR(reg_idx <= 6);
    ASSERT_ERR((((uint32_t)rxlnagain << 8) & ~((uint32_t)0x00000300)) == 0);
    REG_RPL_WR(RPL_RFRXGAINTABLE_ADDR + reg_idx * 1, (REG_RPL_RD(RPL_RFRXGAINTABLE_ADDR + reg_idx * 1) & ~((uint32_t)0x00000300)) | ((uint32_t)rxlnagain << 8));
}

__STATIC_FORCEINLINE uint8_t rpl_rxmix_gain_getf(int reg_idx)
{
    ASSERT_ERR(reg_idx <= 6);
    uint32_t localVal = REG_RPL_RD(RPL_RFRXGAINTABLE_ADDR + reg_idx * 1);
    return ((localVal & ((uint32_t)0x00000030)) >> 4);
}

__STATIC_FORCEINLINE void rpl_rxmix_gain_setf(int reg_idx, uint8_t rxmixgain)
{
    ASSERT_ERR(reg_idx <= 6);
    ASSERT_ERR((((uint32_t)rxmixgain << 4) & ~((uint32_t)0x00000030)) == 0);
    REG_RPL_WR(RPL_RFRXGAINTABLE_ADDR + reg_idx * 1, (REG_RPL_RD(RPL_RFRXGAINTABLE_ADDR + reg_idx * 1) & ~((uint32_t)0x00000030)) | ((uint32_t)rxmixgain << 4));
}

__STATIC_FORCEINLINE uint8_t rpl_rxfilter_gain_getf(int reg_idx)
{
    ASSERT_ERR(reg_idx <= 6);
    uint32_t localVal = REG_RPL_RD(RPL_RFRXGAINTABLE_ADDR + reg_idx * 1);
    return ((localVal & ((uint32_t)0x00000007)) >> 0);
}

__STATIC_FORCEINLINE void rpl_rxfilter_gain_setf(int reg_idx, uint8_t rxfiltergain)
{
    ASSERT_ERR(reg_idx <= 6);
    ASSERT_ERR((((uint32_t)rxfiltergain << 0) & ~((uint32_t)0x00000007)) == 0);
    REG_RPL_WR(RPL_RFRXGAINTABLE_ADDR + reg_idx * 1, (REG_RPL_RD(RPL_RFRXGAINTABLE_ADDR + reg_idx * 1) & ~((uint32_t)0x00000007)) | ((uint32_t)rxfiltergain << 0));
}

/**
 * @brief RFPOWER_CNTL register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  30:28        LDO_RXTX_TRIM   0x0
 *  27:25        LDO_VDIG_TRIM   0x0
 *  24:22        LDO_ADDA_TRIM   0x0
 *  21:19         LDO_VCO_TRIM   0x0
 *  18:16          LDO_XO_TRIM   0x0
 *  15:13         LDO_PLL_TRIM   0x0
 *  12:10        LDO_BGAP_TRIM   0x0
 *     09     LDO_RXTX_LP_MODE   0
 *     08     LDA_ADDA_LP_MODE   0
 *     07      LDO_VCO_LP_MODE   0
 *     06      LDO_PLL_LP_MODE   0
 *     05       LDO_XO_LP_MODE   0
 *     04          LDO_RXTX_ON   0
 *     03          LDO_ADDA_ON   0
 *     02           LDO_VCO_ON   0
 *     01           LDO_PLL_ON   0
 *     00            LDO_XO_ON   1
 * </pre>
 */
#define RPL_RFPOWER_CNTL_ADDR   0x00000048
#define RPL_RFPOWER_CNTL_OFFSET 0x00000048
#define RPL_RFPOWER_CNTL_INDEX  0x00000048
#define RPL_RFPOWER_CNTL_RESET  0x00000001

__STATIC_FORCEINLINE uint32_t rpl_rfpower_cntl_get(void)
{
    return REG_RPL_RD(RPL_RFPOWER_CNTL_ADDR);
}

__STATIC_FORCEINLINE void rpl_rfpower_cntl_set(uint32_t value)
{
    REG_RPL_WR(RPL_RFPOWER_CNTL_ADDR, value);
}

// field definitions
#define RPL_LDO_RXTX_TRIM_MASK      ((uint32_t)0x70000000)
#define RPL_LDO_RXTX_TRIM_LSB       28
#define RPL_LDO_RXTX_TRIM_WIDTH     ((uint32_t)0x00000003)
#define RPL_LDO_VDIG_TRIM_MASK      ((uint32_t)0x0E000000)
#define RPL_LDO_VDIG_TRIM_LSB       25
#define RPL_LDO_VDIG_TRIM_WIDTH     ((uint32_t)0x00000003)
#define RPL_LDO_ADDA_TRIM_MASK      ((uint32_t)0x01C00000)
#define RPL_LDO_ADDA_TRIM_LSB       22
#define RPL_LDO_ADDA_TRIM_WIDTH     ((uint32_t)0x00000003)
#define RPL_LDO_VCO_TRIM_MASK       ((uint32_t)0x00380000)
#define RPL_LDO_VCO_TRIM_LSB        19
#define RPL_LDO_VCO_TRIM_WIDTH      ((uint32_t)0x00000003)
#define RPL_LDO_XO_TRIM_MASK        ((uint32_t)0x00070000)
#define RPL_LDO_XO_TRIM_LSB         16
#define RPL_LDO_XO_TRIM_WIDTH       ((uint32_t)0x00000003)
#define RPL_LDO_PLL_TRIM_MASK       ((uint32_t)0x0000E000)
#define RPL_LDO_PLL_TRIM_LSB        13
#define RPL_LDO_PLL_TRIM_WIDTH      ((uint32_t)0x00000003)
#define RPL_LDO_BGAP_TRIM_MASK      ((uint32_t)0x00001C00)
#define RPL_LDO_BGAP_TRIM_LSB       10
#define RPL_LDO_BGAP_TRIM_WIDTH     ((uint32_t)0x00000003)
#define RPL_LDO_RXTX_LP_MODE_BIT    ((uint32_t)0x00000200)
#define RPL_LDO_RXTX_LP_MODE_POS    9
#define RPL_LDA_ADDA_LP_MODE_BIT    ((uint32_t)0x00000100)
#define RPL_LDA_ADDA_LP_MODE_POS    8
#define RPL_LDO_VCO_LP_MODE_BIT     ((uint32_t)0x00000080)
#define RPL_LDO_VCO_LP_MODE_POS     7
#define RPL_LDO_PLL_LP_MODE_BIT     ((uint32_t)0x00000040)
#define RPL_LDO_PLL_LP_MODE_POS     6
#define RPL_LDO_XO_LP_MODE_BIT      ((uint32_t)0x00000020)
#define RPL_LDO_XO_LP_MODE_POS      5
#define RPL_LDO_RXTX_ON_BIT         ((uint32_t)0x00000010)
#define RPL_LDO_RXTX_ON_POS         4
#define RPL_LDO_ADDA_ON_BIT         ((uint32_t)0x00000008)
#define RPL_LDO_ADDA_ON_POS         3
#define RPL_LDO_VCO_ON_BIT          ((uint32_t)0x00000004)
#define RPL_LDO_VCO_ON_POS          2
#define RPL_LDO_PLL_ON_BIT          ((uint32_t)0x00000002)
#define RPL_LDO_PLL_ON_POS          1
#define RPL_LDO_XO_ON_BIT           ((uint32_t)0x00000001)
#define RPL_LDO_XO_ON_POS           0

#define RPL_LDO_RXTX_TRIM_RST       0x0
#define RPL_LDO_VDIG_TRIM_RST       0x0
#define RPL_LDO_ADDA_TRIM_RST       0x0
#define RPL_LDO_VCO_TRIM_RST        0x0
#define RPL_LDO_XO_TRIM_RST         0x0
#define RPL_LDO_PLL_TRIM_RST        0x0
#define RPL_LDO_BGAP_TRIM_RST       0x0
#define RPL_LDO_RXTX_LP_MODE_RST    0x0
#define RPL_LDA_ADDA_LP_MODE_RST    0x0
#define RPL_LDO_VCO_LP_MODE_RST     0x0
#define RPL_LDO_PLL_LP_MODE_RST     0x0
#define RPL_LDO_XO_LP_MODE_RST      0x0
#define RPL_LDO_RXTX_ON_RST         0x0
#define RPL_LDO_ADDA_ON_RST         0x0
#define RPL_LDO_VCO_ON_RST          0x0
#define RPL_LDO_PLL_ON_RST          0x0
#define RPL_LDO_XO_ON_RST           0x1

__STATIC_FORCEINLINE void rpl_rfpower_cntl_pack(uint8_t ldorxtxtrim, uint8_t ldovdigtrim, uint8_t ldoaddatrim, uint8_t ldovcotrim, uint8_t ldoxotrim, uint8_t ldoplltrim, uint8_t ldobgaptrim, uint8_t ldorxtxlpmode, uint8_t ldaaddalpmode, uint8_t ldovcolpmode, uint8_t ldoplllpmode, uint8_t ldoxolpmode, uint8_t ldorxtxon, uint8_t ldoaddaon, uint8_t ldovcoon, uint8_t ldopllon, uint8_t ldoxoon)
{
    ASSERT_ERR((((uint32_t)ldorxtxtrim << 28) & ~((uint32_t)0x70000000)) == 0);
    ASSERT_ERR((((uint32_t)ldovdigtrim << 25) & ~((uint32_t)0x0E000000)) == 0);
    ASSERT_ERR((((uint32_t)ldoaddatrim << 22) & ~((uint32_t)0x01C00000)) == 0);
    ASSERT_ERR((((uint32_t)ldovcotrim << 19) & ~((uint32_t)0x00380000)) == 0);
    ASSERT_ERR((((uint32_t)ldoxotrim << 16) & ~((uint32_t)0x00070000)) == 0);
    ASSERT_ERR((((uint32_t)ldoplltrim << 13) & ~((uint32_t)0x0000E000)) == 0);
    ASSERT_ERR((((uint32_t)ldobgaptrim << 10) & ~((uint32_t)0x00001C00)) == 0);
    ASSERT_ERR((((uint32_t)ldorxtxlpmode << 9) & ~((uint32_t)0x00000200)) == 0);
    ASSERT_ERR((((uint32_t)ldaaddalpmode << 8) & ~((uint32_t)0x00000100)) == 0);
    ASSERT_ERR((((uint32_t)ldovcolpmode << 7) & ~((uint32_t)0x00000080)) == 0);
    ASSERT_ERR((((uint32_t)ldoplllpmode << 6) & ~((uint32_t)0x00000040)) == 0);
    ASSERT_ERR((((uint32_t)ldoxolpmode << 5) & ~((uint32_t)0x00000020)) == 0);
    ASSERT_ERR((((uint32_t)ldorxtxon << 4) & ~((uint32_t)0x00000010)) == 0);
    ASSERT_ERR((((uint32_t)ldoaddaon << 3) & ~((uint32_t)0x00000008)) == 0);
    ASSERT_ERR((((uint32_t)ldovcoon << 2) & ~((uint32_t)0x00000004)) == 0);
    ASSERT_ERR((((uint32_t)ldopllon << 1) & ~((uint32_t)0x00000002)) == 0);
    ASSERT_ERR((((uint32_t)ldoxoon << 0) & ~((uint32_t)0x00000001)) == 0);
    REG_RPL_WR(RPL_RFPOWER_CNTL_ADDR,  ((uint32_t)ldorxtxtrim << 28) | ((uint32_t)ldovdigtrim << 25) | ((uint32_t)ldoaddatrim << 22) | ((uint32_t)ldovcotrim << 19) | ((uint32_t)ldoxotrim << 16) | ((uint32_t)ldoplltrim << 13) | ((uint32_t)ldobgaptrim << 10) | ((uint32_t)ldorxtxlpmode << 9) | ((uint32_t)ldaaddalpmode << 8) | ((uint32_t)ldovcolpmode << 7) | ((uint32_t)ldoplllpmode << 6) | ((uint32_t)ldoxolpmode << 5) | ((uint32_t)ldorxtxon << 4) | ((uint32_t)ldoaddaon << 3) | ((uint32_t)ldovcoon << 2) | ((uint32_t)ldopllon << 1) | ((uint32_t)ldoxoon << 0));
}

__STATIC_FORCEINLINE void rpl_rfpower_cntl_unpack(uint8_t* ldorxtxtrim, uint8_t* ldovdigtrim, uint8_t* ldoaddatrim, uint8_t* ldovcotrim, uint8_t* ldoxotrim, uint8_t* ldoplltrim, uint8_t* ldobgaptrim, uint8_t* ldorxtxlpmode, uint8_t* ldaaddalpmode, uint8_t* ldovcolpmode, uint8_t* ldoplllpmode, uint8_t* ldoxolpmode, uint8_t* ldorxtxon, uint8_t* ldoaddaon, uint8_t* ldovcoon, uint8_t* ldopllon, uint8_t* ldoxoon)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFPOWER_CNTL_ADDR);

    *ldorxtxtrim = (localVal & ((uint32_t)0x70000000)) >> 28;
    *ldovdigtrim = (localVal & ((uint32_t)0x0E000000)) >> 25;
    *ldoaddatrim = (localVal & ((uint32_t)0x01C00000)) >> 22;
    *ldovcotrim = (localVal & ((uint32_t)0x00380000)) >> 19;
    *ldoxotrim = (localVal & ((uint32_t)0x00070000)) >> 16;
    *ldoplltrim = (localVal & ((uint32_t)0x0000E000)) >> 13;
    *ldobgaptrim = (localVal & ((uint32_t)0x00001C00)) >> 10;
    *ldorxtxlpmode = (localVal & ((uint32_t)0x00000200)) >> 9;
    *ldaaddalpmode = (localVal & ((uint32_t)0x00000100)) >> 8;
    *ldovcolpmode = (localVal & ((uint32_t)0x00000080)) >> 7;
    *ldoplllpmode = (localVal & ((uint32_t)0x00000040)) >> 6;
    *ldoxolpmode = (localVal & ((uint32_t)0x00000020)) >> 5;
    *ldorxtxon = (localVal & ((uint32_t)0x00000010)) >> 4;
    *ldoaddaon = (localVal & ((uint32_t)0x00000008)) >> 3;
    *ldovcoon = (localVal & ((uint32_t)0x00000004)) >> 2;
    *ldopllon = (localVal & ((uint32_t)0x00000002)) >> 1;
    *ldoxoon = (localVal & ((uint32_t)0x00000001)) >> 0;
}

__STATIC_FORCEINLINE uint8_t rpl_ldo_rxtx_trim_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFPOWER_CNTL_ADDR);
    return ((localVal & ((uint32_t)0x70000000)) >> 28);
}

__STATIC_FORCEINLINE void rpl_ldo_rxtx_trim_setf(uint8_t ldorxtxtrim)
{
    ASSERT_ERR((((uint32_t)ldorxtxtrim << 28) & ~((uint32_t)0x70000000)) == 0);
    REG_RPL_WR(RPL_RFPOWER_CNTL_ADDR, (REG_RPL_RD(RPL_RFPOWER_CNTL_ADDR) & ~((uint32_t)0x70000000)) | ((uint32_t)ldorxtxtrim << 28));
}

__STATIC_FORCEINLINE uint8_t rpl_ldo_vdig_trim_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFPOWER_CNTL_ADDR);
    return ((localVal & ((uint32_t)0x0E000000)) >> 25);
}

__STATIC_FORCEINLINE void rpl_ldo_vdig_trim_setf(uint8_t ldovdigtrim)
{
    ASSERT_ERR((((uint32_t)ldovdigtrim << 25) & ~((uint32_t)0x0E000000)) == 0);
    REG_RPL_WR(RPL_RFPOWER_CNTL_ADDR, (REG_RPL_RD(RPL_RFPOWER_CNTL_ADDR) & ~((uint32_t)0x0E000000)) | ((uint32_t)ldovdigtrim << 25));
}

__STATIC_FORCEINLINE uint8_t rpl_ldo_adda_trim_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFPOWER_CNTL_ADDR);
    return ((localVal & ((uint32_t)0x01C00000)) >> 22);
}

__STATIC_FORCEINLINE void rpl_ldo_adda_trim_setf(uint8_t ldoaddatrim)
{
    ASSERT_ERR((((uint32_t)ldoaddatrim << 22) & ~((uint32_t)0x01C00000)) == 0);
    REG_RPL_WR(RPL_RFPOWER_CNTL_ADDR, (REG_RPL_RD(RPL_RFPOWER_CNTL_ADDR) & ~((uint32_t)0x01C00000)) | ((uint32_t)ldoaddatrim << 22));
}

