sriharimaddula/ble-sdk6-examples/SDK_6.0.24.1464/DA145xx_SDK/6.0.24.1464/sdk/platform/driver/ble/reg_ripple.h
__STATIC_FORCEINLINE uint8_t rpl_ldo_vco_trim_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFPOWER_CNTL_ADDR);
    return ((localVal & ((uint32_t)0x00380000)) >> 19);
}

__STATIC_FORCEINLINE void rpl_ldo_vco_trim_setf(uint8_t ldovcotrim)
{
    ASSERT_ERR((((uint32_t)ldovcotrim << 19) & ~((uint32_t)0x00380000)) == 0);
    REG_RPL_WR(RPL_RFPOWER_CNTL_ADDR, (REG_RPL_RD(RPL_RFPOWER_CNTL_ADDR) & ~((uint32_t)0x00380000)) | ((uint32_t)ldovcotrim << 19));
}

__STATIC_FORCEINLINE uint8_t rpl_ldo_xo_trim_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFPOWER_CNTL_ADDR);
    return ((localVal & ((uint32_t)0x00070000)) >> 16);
}

__STATIC_FORCEINLINE void rpl_ldo_xo_trim_setf(uint8_t ldoxotrim)
{
    ASSERT_ERR((((uint32_t)ldoxotrim << 16) & ~((uint32_t)0x00070000)) == 0);
    REG_RPL_WR(RPL_RFPOWER_CNTL_ADDR, (REG_RPL_RD(RPL_RFPOWER_CNTL_ADDR) & ~((uint32_t)0x00070000)) | ((uint32_t)ldoxotrim << 16));
}

__STATIC_FORCEINLINE uint8_t rpl_ldo_pll_trim_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFPOWER_CNTL_ADDR);
    return ((localVal & ((uint32_t)0x0000E000)) >> 13);
}

__STATIC_FORCEINLINE void rpl_ldo_pll_trim_setf(uint8_t ldoplltrim)
{
    ASSERT_ERR((((uint32_t)ldoplltrim << 13) & ~((uint32_t)0x0000E000)) == 0);
    REG_RPL_WR(RPL_RFPOWER_CNTL_ADDR, (REG_RPL_RD(RPL_RFPOWER_CNTL_ADDR) & ~((uint32_t)0x0000E000)) | ((uint32_t)ldoplltrim << 13));
}

__STATIC_FORCEINLINE uint8_t rpl_ldo_bgap_trim_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFPOWER_CNTL_ADDR);
    return ((localVal & ((uint32_t)0x00001C00)) >> 10);
}

__STATIC_FORCEINLINE void rpl_ldo_bgap_trim_setf(uint8_t ldobgaptrim)
{
    ASSERT_ERR((((uint32_t)ldobgaptrim << 10) & ~((uint32_t)0x00001C00)) == 0);
    REG_RPL_WR(RPL_RFPOWER_CNTL_ADDR, (REG_RPL_RD(RPL_RFPOWER_CNTL_ADDR) & ~((uint32_t)0x00001C00)) | ((uint32_t)ldobgaptrim << 10));
}

__STATIC_FORCEINLINE uint8_t rpl_ldo_rxtx_lp_mode_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFPOWER_CNTL_ADDR);
    return ((localVal & ((uint32_t)0x00000200)) >> 9);
}

__STATIC_FORCEINLINE void rpl_ldo_rxtx_lp_mode_setf(uint8_t ldorxtxlpmode)
{
    ASSERT_ERR((((uint32_t)ldorxtxlpmode << 9) & ~((uint32_t)0x00000200)) == 0);
    REG_RPL_WR(RPL_RFPOWER_CNTL_ADDR, (REG_RPL_RD(RPL_RFPOWER_CNTL_ADDR) & ~((uint32_t)0x00000200)) | ((uint32_t)ldorxtxlpmode << 9));
}

__STATIC_FORCEINLINE uint8_t rpl_lda_adda_lp_mode_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFPOWER_CNTL_ADDR);
    return ((localVal & ((uint32_t)0x00000100)) >> 8);
}

__STATIC_FORCEINLINE void rpl_lda_adda_lp_mode_setf(uint8_t ldaaddalpmode)
{
    ASSERT_ERR((((uint32_t)ldaaddalpmode << 8) & ~((uint32_t)0x00000100)) == 0);
    REG_RPL_WR(RPL_RFPOWER_CNTL_ADDR, (REG_RPL_RD(RPL_RFPOWER_CNTL_ADDR) & ~((uint32_t)0x00000100)) | ((uint32_t)ldaaddalpmode << 8));
}

__STATIC_FORCEINLINE uint8_t rpl_ldo_vco_lp_mode_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFPOWER_CNTL_ADDR);
    return ((localVal & ((uint32_t)0x00000080)) >> 7);
}

__STATIC_FORCEINLINE void rpl_ldo_vco_lp_mode_setf(uint8_t ldovcolpmode)
{
    ASSERT_ERR((((uint32_t)ldovcolpmode << 7) & ~((uint32_t)0x00000080)) == 0);
    REG_RPL_WR(RPL_RFPOWER_CNTL_ADDR, (REG_RPL_RD(RPL_RFPOWER_CNTL_ADDR) & ~((uint32_t)0x00000080)) | ((uint32_t)ldovcolpmode << 7));
}

__STATIC_FORCEINLINE uint8_t rpl_ldo_pll_lp_mode_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFPOWER_CNTL_ADDR);
    return ((localVal & ((uint32_t)0x00000040)) >> 6);
}

__STATIC_FORCEINLINE void rpl_ldo_pll_lp_mode_setf(uint8_t ldoplllpmode)
{
    ASSERT_ERR((((uint32_t)ldoplllpmode << 6) & ~((uint32_t)0x00000040)) == 0);
    REG_RPL_WR(RPL_RFPOWER_CNTL_ADDR, (REG_RPL_RD(RPL_RFPOWER_CNTL_ADDR) & ~((uint32_t)0x00000040)) | ((uint32_t)ldoplllpmode << 6));
}

__STATIC_FORCEINLINE uint8_t rpl_ldo_xo_lp_mode_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFPOWER_CNTL_ADDR);
    return ((localVal & ((uint32_t)0x00000020)) >> 5);
}

__STATIC_FORCEINLINE void rpl_ldo_xo_lp_mode_setf(uint8_t ldoxolpmode)
{
    ASSERT_ERR((((uint32_t)ldoxolpmode << 5) & ~((uint32_t)0x00000020)) == 0);
    REG_RPL_WR(RPL_RFPOWER_CNTL_ADDR, (REG_RPL_RD(RPL_RFPOWER_CNTL_ADDR) & ~((uint32_t)0x00000020)) | ((uint32_t)ldoxolpmode << 5));
}

__STATIC_FORCEINLINE uint8_t rpl_ldo_rxtx_on_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFPOWER_CNTL_ADDR);
    return ((localVal & ((uint32_t)0x00000010)) >> 4);
}

__STATIC_FORCEINLINE void rpl_ldo_rxtx_on_setf(uint8_t ldorxtxon)
{
    ASSERT_ERR((((uint32_t)ldorxtxon << 4) & ~((uint32_t)0x00000010)) == 0);
    REG_RPL_WR(RPL_RFPOWER_CNTL_ADDR, (REG_RPL_RD(RPL_RFPOWER_CNTL_ADDR) & ~((uint32_t)0x00000010)) | ((uint32_t)ldorxtxon << 4));
}

__STATIC_FORCEINLINE uint8_t rpl_ldo_adda_on_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFPOWER_CNTL_ADDR);
    return ((localVal & ((uint32_t)0x00000008)) >> 3);
}

__STATIC_FORCEINLINE void rpl_ldo_adda_on_setf(uint8_t ldoaddaon)
{
    ASSERT_ERR((((uint32_t)ldoaddaon << 3) & ~((uint32_t)0x00000008)) == 0);
    REG_RPL_WR(RPL_RFPOWER_CNTL_ADDR, (REG_RPL_RD(RPL_RFPOWER_CNTL_ADDR) & ~((uint32_t)0x00000008)) | ((uint32_t)ldoaddaon << 3));
}

__STATIC_FORCEINLINE uint8_t rpl_ldo_vco_on_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFPOWER_CNTL_ADDR);
    return ((localVal & ((uint32_t)0x00000004)) >> 2);
}

__STATIC_FORCEINLINE void rpl_ldo_vco_on_setf(uint8_t ldovcoon)
{
    ASSERT_ERR((((uint32_t)ldovcoon << 2) & ~((uint32_t)0x00000004)) == 0);
    REG_RPL_WR(RPL_RFPOWER_CNTL_ADDR, (REG_RPL_RD(RPL_RFPOWER_CNTL_ADDR) & ~((uint32_t)0x00000004)) | ((uint32_t)ldovcoon << 2));
}

__STATIC_FORCEINLINE uint8_t rpl_ldo_pll_on_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFPOWER_CNTL_ADDR);
    return ((localVal & ((uint32_t)0x00000002)) >> 1);
}

__STATIC_FORCEINLINE void rpl_ldo_pll_on_setf(uint8_t ldopllon)
{
    ASSERT_ERR((((uint32_t)ldopllon << 1) & ~((uint32_t)0x00000002)) == 0);
    REG_RPL_WR(RPL_RFPOWER_CNTL_ADDR, (REG_RPL_RD(RPL_RFPOWER_CNTL_ADDR) & ~((uint32_t)0x00000002)) | ((uint32_t)ldopllon << 1));
}

__STATIC_FORCEINLINE uint8_t rpl_ldo_xo_on_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFPOWER_CNTL_ADDR);
    return ((localVal & ((uint32_t)0x00000001)) >> 0);
}

__STATIC_FORCEINLINE void rpl_ldo_xo_on_setf(uint8_t ldoxoon)
{
    ASSERT_ERR((((uint32_t)ldoxoon << 0) & ~((uint32_t)0x00000001)) == 0);
    REG_RPL_WR(RPL_RFPOWER_CNTL_ADDR, (REG_RPL_RD(RPL_RFPOWER_CNTL_ADDR) & ~((uint32_t)0x00000001)) | ((uint32_t)ldoxoon << 0));
}

/**
 * @brief RAMPGENCNTL register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  31:30             EPC_MODE   0x0
 *  28:20       EDR_SWITCH_CNT   0xD9
 *  15:08             GAIN_DEC   0x1
 *  07:00            GAIN_INCR   0x1
 * </pre>
 */
#define RPL_RAMPGENCNTL_ADDR   0x00000049
#define RPL_RAMPGENCNTL_OFFSET 0x00000049
#define RPL_RAMPGENCNTL_INDEX  0x00000049
#define RPL_RAMPGENCNTL_RESET  0x0D900101

__STATIC_FORCEINLINE uint32_t rpl_rampgencntl_get(void)
{
    return REG_RPL_RD(RPL_RAMPGENCNTL_ADDR);
}

__STATIC_FORCEINLINE void rpl_rampgencntl_set(uint32_t value)
{
    REG_RPL_WR(RPL_RAMPGENCNTL_ADDR, value);
}

