sriharimaddula/ble-sdk6-examples/SDK_6.0.24.1464/DA145xx_SDK/6.0.24.1464/sdk/platform/driver/ble/reg_ripple.h
__STATIC_FORCEINLINE uint8_t rpl_tx_dqpsk_paint_gain_getf(int reg_idx)
{
    ASSERT_ERR(reg_idx <= 15);
    uint32_t localVal = REG_RPL_RD(RPL_RFTX_EDR_GAIN_TABLE_ADDR + reg_idx * 1);
    return ((localVal & ((uint32_t)0x00700000)) >> 20);
}

__STATIC_FORCEINLINE void rpl_tx_dqpsk_paint_gain_setf(int reg_idx, uint8_t txdqpskpaintgain)
{
    ASSERT_ERR(reg_idx <= 15);
    ASSERT_ERR((((uint32_t)txdqpskpaintgain << 20) & ~((uint32_t)0x00700000)) == 0);
    REG_RPL_WR(RPL_RFTX_EDR_GAIN_TABLE_ADDR + reg_idx * 1, (REG_RPL_RD(RPL_RFTX_EDR_GAIN_TABLE_ADDR + reg_idx * 1) & ~((uint32_t)0x00700000)) | ((uint32_t)txdqpskpaintgain << 20));
}

__STATIC_FORCEINLINE uint8_t rpl_tx_dqpsk_drv_gain_getf(int reg_idx)
{
    ASSERT_ERR(reg_idx <= 15);
    uint32_t localVal = REG_RPL_RD(RPL_RFTX_EDR_GAIN_TABLE_ADDR + reg_idx * 1);
    return ((localVal & ((uint32_t)0x00070000)) >> 16);
}

__STATIC_FORCEINLINE void rpl_tx_dqpsk_drv_gain_setf(int reg_idx, uint8_t txdqpskdrvgain)
{
    ASSERT_ERR(reg_idx <= 15);
    ASSERT_ERR((((uint32_t)txdqpskdrvgain << 16) & ~((uint32_t)0x00070000)) == 0);
    REG_RPL_WR(RPL_RFTX_EDR_GAIN_TABLE_ADDR + reg_idx * 1, (REG_RPL_RD(RPL_RFTX_EDR_GAIN_TABLE_ADDR + reg_idx * 1) & ~((uint32_t)0x00070000)) | ((uint32_t)txdqpskdrvgain << 16));
}

__STATIC_FORCEINLINE uint8_t rpl_tx_dqpsk_filter_gain_getf(int reg_idx)
{
    ASSERT_ERR(reg_idx <= 15);
    uint32_t localVal = REG_RPL_RD(RPL_RFTX_EDR_GAIN_TABLE_ADDR + reg_idx * 1);
    return ((localVal & ((uint32_t)0x00007000)) >> 12);
}

__STATIC_FORCEINLINE void rpl_tx_dqpsk_filter_gain_setf(int reg_idx, uint8_t txdqpskfiltergain)
{
    ASSERT_ERR(reg_idx <= 15);
    ASSERT_ERR((((uint32_t)txdqpskfiltergain << 12) & ~((uint32_t)0x00007000)) == 0);
    REG_RPL_WR(RPL_RFTX_EDR_GAIN_TABLE_ADDR + reg_idx * 1, (REG_RPL_RD(RPL_RFTX_EDR_GAIN_TABLE_ADDR + reg_idx * 1) & ~((uint32_t)0x00007000)) | ((uint32_t)txdqpskfiltergain << 12));
}

__STATIC_FORCEINLINE uint8_t rpl_tx_8dpsk_paint_gain_getf(int reg_idx)
{
    ASSERT_ERR(reg_idx <= 15);
    uint32_t localVal = REG_RPL_RD(RPL_RFTX_EDR_GAIN_TABLE_ADDR + reg_idx * 1);
    return ((localVal & ((uint32_t)0x00000700)) >> 8);
}

__STATIC_FORCEINLINE void rpl_tx_8dpsk_paint_gain_setf(int reg_idx, uint8_t tx8dpskpaintgain)
{
    ASSERT_ERR(reg_idx <= 15);
    ASSERT_ERR((((uint32_t)tx8dpskpaintgain << 8) & ~((uint32_t)0x00000700)) == 0);
    REG_RPL_WR(RPL_RFTX_EDR_GAIN_TABLE_ADDR + reg_idx * 1, (REG_RPL_RD(RPL_RFTX_EDR_GAIN_TABLE_ADDR + reg_idx * 1) & ~((uint32_t)0x00000700)) | ((uint32_t)tx8dpskpaintgain << 8));
}

__STATIC_FORCEINLINE uint8_t rpl_tx_8dpsk_drv_gain_getf(int reg_idx)
{
    ASSERT_ERR(reg_idx <= 15);
    uint32_t localVal = REG_RPL_RD(RPL_RFTX_EDR_GAIN_TABLE_ADDR + reg_idx * 1);
    return ((localVal & ((uint32_t)0x00000070)) >> 4);
}

__STATIC_FORCEINLINE void rpl_tx_8dpsk_drv_gain_setf(int reg_idx, uint8_t tx8dpskdrvgain)
{
    ASSERT_ERR(reg_idx <= 15);
    ASSERT_ERR((((uint32_t)tx8dpskdrvgain << 4) & ~((uint32_t)0x00000070)) == 0);
    REG_RPL_WR(RPL_RFTX_EDR_GAIN_TABLE_ADDR + reg_idx * 1, (REG_RPL_RD(RPL_RFTX_EDR_GAIN_TABLE_ADDR + reg_idx * 1) & ~((uint32_t)0x00000070)) | ((uint32_t)tx8dpskdrvgain << 4));
}

__STATIC_FORCEINLINE uint8_t rpl_tx_8dpsk_filter_gain_getf(int reg_idx)
{
    ASSERT_ERR(reg_idx <= 15);
    uint32_t localVal = REG_RPL_RD(RPL_RFTX_EDR_GAIN_TABLE_ADDR + reg_idx * 1);
    return ((localVal & ((uint32_t)0x00000007)) >> 0);
}

__STATIC_FORCEINLINE void rpl_tx_8dpsk_filter_gain_setf(int reg_idx, uint8_t tx8dpskfiltergain)
{
    ASSERT_ERR(reg_idx <= 15);
    ASSERT_ERR((((uint32_t)tx8dpskfiltergain << 0) & ~((uint32_t)0x00000007)) == 0);
    REG_RPL_WR(RPL_RFTX_EDR_GAIN_TABLE_ADDR + reg_idx * 1, (REG_RPL_RD(RPL_RFTX_EDR_GAIN_TABLE_ADDR + reg_idx * 1) & ~((uint32_t)0x00000007)) | ((uint32_t)tx8dpskfiltergain << 0));
}

/**
 * @brief RFTX_DACIQ_GAIN register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  22:20    TXDACQ_8DPSK_GAIN   0x0
 *  18:16    TXDACI_8DPSK_GAIN   0x0
 *  14:12    TXDACQ_DQPSK_GAIN   0x0
 *  10:08    TXDACI_DQPSK_GAIN   0x0
 *  06:04     TXDACQ_GFSK_GAIN   0x0
 *  02:00     TXDACI_GFSK_GAIN   0x0
 * </pre>
 */
#define RPL_RFTX_DACIQ_GAIN_ADDR   0x0000006A
#define RPL_RFTX_DACIQ_GAIN_OFFSET 0x0000006A
#define RPL_RFTX_DACIQ_GAIN_INDEX  0x0000006A
#define RPL_RFTX_DACIQ_GAIN_RESET  0x00000000

__STATIC_FORCEINLINE uint32_t rpl_rftx_daciq_gain_get(void)
{
    return REG_RPL_RD(RPL_RFTX_DACIQ_GAIN_ADDR);
}

__STATIC_FORCEINLINE void rpl_rftx_daciq_gain_set(uint32_t value)
{
    REG_RPL_WR(RPL_RFTX_DACIQ_GAIN_ADDR, value);
}

// field definitions
#define RPL_TXDACQ_8DPSK_GAIN_MASK   ((uint32_t)0x00700000)
#define RPL_TXDACQ_8DPSK_GAIN_LSB    20
#define RPL_TXDACQ_8DPSK_GAIN_WIDTH  ((uint32_t)0x00000003)
#define RPL_TXDACI_8DPSK_GAIN_MASK   ((uint32_t)0x00070000)
#define RPL_TXDACI_8DPSK_GAIN_LSB    16
#define RPL_TXDACI_8DPSK_GAIN_WIDTH  ((uint32_t)0x00000003)
#define RPL_TXDACQ_DQPSK_GAIN_MASK   ((uint32_t)0x00007000)
#define RPL_TXDACQ_DQPSK_GAIN_LSB    12
#define RPL_TXDACQ_DQPSK_GAIN_WIDTH  ((uint32_t)0x00000003)
#define RPL_TXDACI_DQPSK_GAIN_MASK   ((uint32_t)0x00000700)
#define RPL_TXDACI_DQPSK_GAIN_LSB    8
#define RPL_TXDACI_DQPSK_GAIN_WIDTH  ((uint32_t)0x00000003)
#define RPL_TXDACQ_GFSK_GAIN_MASK    ((uint32_t)0x00000070)
#define RPL_TXDACQ_GFSK_GAIN_LSB     4
#define RPL_TXDACQ_GFSK_GAIN_WIDTH   ((uint32_t)0x00000003)
#define RPL_TXDACI_GFSK_GAIN_MASK    ((uint32_t)0x00000007)
#define RPL_TXDACI_GFSK_GAIN_LSB     0
#define RPL_TXDACI_GFSK_GAIN_WIDTH   ((uint32_t)0x00000003)

#define RPL_TXDACQ_8DPSK_GAIN_RST    0x0
#define RPL_TXDACI_8DPSK_GAIN_RST    0x0
#define RPL_TXDACQ_DQPSK_GAIN_RST    0x0
#define RPL_TXDACI_DQPSK_GAIN_RST    0x0
#define RPL_TXDACQ_GFSK_GAIN_RST     0x0
#define RPL_TXDACI_GFSK_GAIN_RST     0x0

__STATIC_FORCEINLINE void rpl_rftx_daciq_gain_pack(uint8_t txdacq8dpskgain, uint8_t txdaci8dpskgain, uint8_t txdacqdqpskgain, uint8_t txdacidqpskgain, uint8_t txdacqgfskgain, uint8_t txdacigfskgain)
{
    ASSERT_ERR((((uint32_t)txdacq8dpskgain << 20) & ~((uint32_t)0x00700000)) == 0);
    ASSERT_ERR((((uint32_t)txdaci8dpskgain << 16) & ~((uint32_t)0x00070000)) == 0);
    ASSERT_ERR((((uint32_t)txdacqdqpskgain << 12) & ~((uint32_t)0x00007000)) == 0);
    ASSERT_ERR((((uint32_t)txdacidqpskgain << 8) & ~((uint32_t)0x00000700)) == 0);
    ASSERT_ERR((((uint32_t)txdacqgfskgain << 4) & ~((uint32_t)0x00000070)) == 0);
    ASSERT_ERR((((uint32_t)txdacigfskgain << 0) & ~((uint32_t)0x00000007)) == 0);
    REG_RPL_WR(RPL_RFTX_DACIQ_GAIN_ADDR,  ((uint32_t)txdacq8dpskgain << 20) | ((uint32_t)txdaci8dpskgain << 16) | ((uint32_t)txdacqdqpskgain << 12) | ((uint32_t)txdacidqpskgain << 8) | ((uint32_t)txdacqgfskgain << 4) | ((uint32_t)txdacigfskgain << 0));
}

