sriharimaddula/ble-sdk6-examples/SDK_6.0.24.1464/DA145xx_SDK/6.0.24.1464/sdk/platform/driver/ble/reg_ripple.h
__STATIC_FORCEINLINE uint8_t rpl_force_resets_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_CRM_CNTL0_ADDR);
    return ((localVal & ((uint32_t)0x80000000)) >> 31);
}

__STATIC_FORCEINLINE void rpl_force_resets_setf(uint8_t forceresets)
{
    ASSERT_ERR((((uint32_t)forceresets << 31) & ~((uint32_t)0x80000000)) == 0);
    REG_RPL_WR(RPL_CRM_CNTL0_ADDR, (REG_RPL_RD(RPL_CRM_CNTL0_ADDR) & ~((uint32_t)0x80000000)) | ((uint32_t)forceresets << 31));
}

__STATIC_FORCEINLINE uint8_t rpl_force_clock_gates_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_CRM_CNTL0_ADDR);
    return ((localVal & ((uint32_t)0x40000000)) >> 30);
}

__STATIC_FORCEINLINE void rpl_force_clock_gates_setf(uint8_t forceclockgates)
{
    ASSERT_ERR((((uint32_t)forceclockgates << 30) & ~((uint32_t)0x40000000)) == 0);
    REG_RPL_WR(RPL_CRM_CNTL0_ADDR, (REG_RPL_RD(RPL_CRM_CNTL0_ADDR) & ~((uint32_t)0x40000000)) | ((uint32_t)forceclockgates << 30));
}

__STATIC_FORCEINLINE uint8_t rpl_dap_txdc_rst_en_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_CRM_CNTL0_ADDR);
    return ((localVal & ((uint32_t)0x10000000)) >> 28);
}

__STATIC_FORCEINLINE void rpl_dap_txdc_rst_en_setf(uint8_t daptxdcrsten)
{
    ASSERT_ERR((((uint32_t)daptxdcrsten << 28) & ~((uint32_t)0x10000000)) == 0);
    REG_RPL_WR(RPL_CRM_CNTL0_ADDR, (REG_RPL_RD(RPL_CRM_CNTL0_ADDR) & ~((uint32_t)0x10000000)) | ((uint32_t)daptxdcrsten << 28));
}

__STATIC_FORCEINLINE uint8_t rpl_rpll_fdiv_rst_en_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_CRM_CNTL0_ADDR);
    return ((localVal & ((uint32_t)0x08000000)) >> 27);
}

__STATIC_FORCEINLINE void rpl_rpll_fdiv_rst_en_setf(uint8_t rpllfdivrsten)
{
    ASSERT_ERR((((uint32_t)rpllfdivrsten << 27) & ~((uint32_t)0x08000000)) == 0);
    REG_RPL_WR(RPL_CRM_CNTL0_ADDR, (REG_RPL_RD(RPL_CRM_CNTL0_ADDR) & ~((uint32_t)0x08000000)) | ((uint32_t)rpllfdivrsten << 27));
}

__STATIC_FORCEINLINE uint8_t rpl_mdm_rst_en_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_CRM_CNTL0_ADDR);
    return ((localVal & ((uint32_t)0x04000000)) >> 26);
}

__STATIC_FORCEINLINE void rpl_mdm_rst_en_setf(uint8_t mdmrsten)
{
    ASSERT_ERR((((uint32_t)mdmrsten << 26) & ~((uint32_t)0x04000000)) == 0);
    REG_RPL_WR(RPL_CRM_CNTL0_ADDR, (REG_RPL_RD(RPL_CRM_CNTL0_ADDR) & ~((uint32_t)0x04000000)) | ((uint32_t)mdmrsten << 26));
}

__STATIC_FORCEINLINE uint8_t rpl_db_rst_en_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_CRM_CNTL0_ADDR);
    return ((localVal & ((uint32_t)0x02000000)) >> 25);
}

__STATIC_FORCEINLINE void rpl_db_rst_en_setf(uint8_t dbrsten)
{
    ASSERT_ERR((((uint32_t)dbrsten << 25) & ~((uint32_t)0x02000000)) == 0);
    REG_RPL_WR(RPL_CRM_CNTL0_ADDR, (REG_RPL_RD(RPL_CRM_CNTL0_ADDR) & ~((uint32_t)0x02000000)) | ((uint32_t)dbrsten << 25));
}

__STATIC_FORCEINLINE uint8_t rpl_agc_rst_en_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_CRM_CNTL0_ADDR);
    return ((localVal & ((uint32_t)0x01000000)) >> 24);
}

__STATIC_FORCEINLINE void rpl_agc_rst_en_setf(uint8_t agcrsten)
{
    ASSERT_ERR((((uint32_t)agcrsten << 24) & ~((uint32_t)0x01000000)) == 0);
    REG_RPL_WR(RPL_CRM_CNTL0_ADDR, (REG_RPL_RD(RPL_CRM_CNTL0_ADDR) & ~((uint32_t)0x01000000)) | ((uint32_t)agcrsten << 24));
}

__STATIC_FORCEINLINE uint8_t rpl_sd_rst_en_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_CRM_CNTL0_ADDR);
    return ((localVal & ((uint32_t)0x00800000)) >> 23);
}

__STATIC_FORCEINLINE void rpl_sd_rst_en_setf(uint8_t sdrsten)
{
    ASSERT_ERR((((uint32_t)sdrsten << 23) & ~((uint32_t)0x00800000)) == 0);
    REG_RPL_WR(RPL_CRM_CNTL0_ADDR, (REG_RPL_RD(RPL_CRM_CNTL0_ADDR) & ~((uint32_t)0x00800000)) | ((uint32_t)sdrsten << 23));
}

__STATIC_FORCEINLINE uint8_t rpl_gfsk_prefilt_rst_en_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_CRM_CNTL0_ADDR);
    return ((localVal & ((uint32_t)0x00400000)) >> 22);
}

__STATIC_FORCEINLINE void rpl_gfsk_prefilt_rst_en_setf(uint8_t gfskprefiltrsten)
{
    ASSERT_ERR((((uint32_t)gfskprefiltrsten << 22) & ~((uint32_t)0x00400000)) == 0);
    REG_RPL_WR(RPL_CRM_CNTL0_ADDR, (REG_RPL_RD(RPL_CRM_CNTL0_ADDR) & ~((uint32_t)0x00400000)) | ((uint32_t)gfskprefiltrsten << 22));
}

__STATIC_FORCEINLINE uint8_t rpl_dap_calib_rst_en_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_CRM_CNTL0_ADDR);
    return ((localVal & ((uint32_t)0x00200000)) >> 21);
}

__STATIC_FORCEINLINE void rpl_dap_calib_rst_en_setf(uint8_t dapcalibrsten)
{
    ASSERT_ERR((((uint32_t)dapcalibrsten << 21) & ~((uint32_t)0x00200000)) == 0);
    REG_RPL_WR(RPL_CRM_CNTL0_ADDR, (REG_RPL_RD(RPL_CRM_CNTL0_ADDR) & ~((uint32_t)0x00200000)) | ((uint32_t)dapcalibrsten << 21));
}

__STATIC_FORCEINLINE uint8_t rpl_dap_rst_en_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_CRM_CNTL0_ADDR);
    return ((localVal & ((uint32_t)0x00100000)) >> 20);
}

__STATIC_FORCEINLINE void rpl_dap_rst_en_setf(uint8_t daprsten)
{
    ASSERT_ERR((((uint32_t)daprsten << 20) & ~((uint32_t)0x00100000)) == 0);
    REG_RPL_WR(RPL_CRM_CNTL0_ADDR, (REG_RPL_RD(RPL_CRM_CNTL0_ADDR) & ~((uint32_t)0x00100000)) | ((uint32_t)daprsten << 20));
}

__STATIC_FORCEINLINE uint8_t rpl_dap_txdc_clk_gate_en_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_CRM_CNTL0_ADDR);
    return ((localVal & ((uint32_t)0x00040000)) >> 18);
}

__STATIC_FORCEINLINE void rpl_dap_txdc_clk_gate_en_setf(uint8_t daptxdcclkgateen)
{
    ASSERT_ERR((((uint32_t)daptxdcclkgateen << 18) & ~((uint32_t)0x00040000)) == 0);
    REG_RPL_WR(RPL_CRM_CNTL0_ADDR, (REG_RPL_RD(RPL_CRM_CNTL0_ADDR) & ~((uint32_t)0x00040000)) | ((uint32_t)daptxdcclkgateen << 18));
}

__STATIC_FORCEINLINE uint8_t rpl_rpll_fdiv_clk_gate_en_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_CRM_CNTL0_ADDR);
    return ((localVal & ((uint32_t)0x00020000)) >> 17);
}

__STATIC_FORCEINLINE void rpl_rpll_fdiv_clk_gate_en_setf(uint8_t rpllfdivclkgateen)
{
    ASSERT_ERR((((uint32_t)rpllfdivclkgateen << 17) & ~((uint32_t)0x00020000)) == 0);
    REG_RPL_WR(RPL_CRM_CNTL0_ADDR, (REG_RPL_RD(RPL_CRM_CNTL0_ADDR) & ~((uint32_t)0x00020000)) | ((uint32_t)rpllfdivclkgateen << 17));
}

__STATIC_FORCEINLINE uint8_t rpl_sar_adc_clk_gate_en_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_CRM_CNTL0_ADDR);
    return ((localVal & ((uint32_t)0x00010000)) >> 16);
}

__STATIC_FORCEINLINE void rpl_sar_adc_clk_gate_en_setf(uint8_t saradcclkgateen)
{
    ASSERT_ERR((((uint32_t)saradcclkgateen << 16) & ~((uint32_t)0x00010000)) == 0);
    REG_RPL_WR(RPL_CRM_CNTL0_ADDR, (REG_RPL_RD(RPL_CRM_CNTL0_ADDR) & ~((uint32_t)0x00010000)) | ((uint32_t)saradcclkgateen << 16));
}

