sriharimaddula/ble-sdk6-examples/SDK_6.0.24.1464/DA145xx_SDK/6.0.24.1464/sdk/platform/driver/ble/reg_ripple.h
// field definitions
#define RPL_RXCTRL_FORCE_BIT        ((uint32_t)0x80000000)
#define RPL_RXCTRL_FORCE_POS        31
#define RPL_RXGAIN_FORCE_BIT        ((uint32_t)0x40000000)
#define RPL_RXGAIN_FORCE_POS        30
#define RPL_FORCE_ADDA_RST_BIT      ((uint32_t)0x20000000)
#define RPL_FORCE_ADDA_RST_POS      29
#define RPL_RSSI_CLK_INV_EN_BIT     ((uint32_t)0x02000000)
#define RPL_RSSI_CLK_INV_EN_POS     25
#define RPL_RXADC_CLK_INV_EN_BIT    ((uint32_t)0x01000000)
#define RPL_RXADC_CLK_INV_EN_POS    24
#define RPL_N_LDO_ADDA_RST_BIT      ((uint32_t)0x00040000)
#define RPL_N_LDO_ADDA_RST_POS      18
#define RPL_RXADC_SATDET_EN_BIT     ((uint32_t)0x00002000)
#define RPL_RXADC_SATDET_EN_POS     13
#define RPL_MODEM_RX_EN_BIT         ((uint32_t)0x00001000)
#define RPL_MODEM_RX_EN_POS         12
#define RPL_RXADC_EN_BIT            ((uint32_t)0x00000800)
#define RPL_RXADC_EN_POS            11
#define RPL_RXADC_ON_BIT            ((uint32_t)0x00000400)
#define RPL_RXADC_ON_POS            10
#define RPL_AGC_EN_BIT              ((uint32_t)0x00000200)
#define RPL_AGC_EN_POS              9
#define RPL_RSSI_ON_BIT             ((uint32_t)0x00000100)
#define RPL_RSSI_ON_POS             8
#define RPL_RXFILT_ON_BIT           ((uint32_t)0x00000080)
#define RPL_RXFILT_ON_POS           7
#define RPL_RXLOBUF_ON_BIT          ((uint32_t)0x00000040)
#define RPL_RXLOBUF_ON_POS          6
#define RPL_RXMIX_ON_BIT            ((uint32_t)0x00000020)
#define RPL_RXMIX_ON_POS            5
#define RPL_RXLNA_ON_BIT            ((uint32_t)0x00000010)
#define RPL_RXLNA_ON_POS            4
#define RPL_RXRF_BIAS_ON_BIT        ((uint32_t)0x00000008)
#define RPL_RXRF_BIAS_ON_POS        3
#define RPL_RXGAIN_SEL_MASK         ((uint32_t)0x00000007)
#define RPL_RXGAIN_SEL_LSB          0
#define RPL_RXGAIN_SEL_WIDTH        ((uint32_t)0x00000003)

#define RPL_RXCTRL_FORCE_RST        0x0
#define RPL_RXGAIN_FORCE_RST        0x0
#define RPL_FORCE_ADDA_RST_RST      0x0
#define RPL_RSSI_CLK_INV_EN_RST     0x0
#define RPL_RXADC_CLK_INV_EN_RST    0x0
#define RPL_N_LDO_ADDA_RST_RST      0x0
#define RPL_RXADC_SATDET_EN_RST     0x0
#define RPL_MODEM_RX_EN_RST         0x0
#define RPL_RXADC_EN_RST            0x0
#define RPL_RXADC_ON_RST            0x0
#define RPL_AGC_EN_RST              0x0
#define RPL_RSSI_ON_RST             0x0
#define RPL_RXFILT_ON_RST           0x0
#define RPL_RXLOBUF_ON_RST          0x0
#define RPL_RXMIX_ON_RST            0x0
#define RPL_RXLNA_ON_RST            0x0
#define RPL_RXRF_BIAS_ON_RST        0x0
#define RPL_RXGAIN_SEL_RST          0x0

__STATIC_FORCEINLINE void rpl_rfrxcntl_pack(uint8_t rxctrlforce, uint8_t rxgainforce, uint8_t forceaddarst, uint8_t rssiclkinven, uint8_t rxadcclkinven, uint8_t nldoaddarst, uint8_t rxadcsatdeten, uint8_t modemrxen, uint8_t rxadcen, uint8_t rxadcon, uint8_t agcen, uint8_t rssion, uint8_t rxfilton, uint8_t rxlobufon, uint8_t rxmixon, uint8_t rxlnaon, uint8_t rxrfbiason, uint8_t rxgainsel)
{
    ASSERT_ERR((((uint32_t)rxctrlforce << 31) & ~((uint32_t)0x80000000)) == 0);
    ASSERT_ERR((((uint32_t)rxgainforce << 30) & ~((uint32_t)0x40000000)) == 0);
    ASSERT_ERR((((uint32_t)forceaddarst << 29) & ~((uint32_t)0x20000000)) == 0);
    ASSERT_ERR((((uint32_t)rssiclkinven << 25) & ~((uint32_t)0x02000000)) == 0);
    ASSERT_ERR((((uint32_t)rxadcclkinven << 24) & ~((uint32_t)0x01000000)) == 0);
    ASSERT_ERR((((uint32_t)nldoaddarst << 18) & ~((uint32_t)0x00040000)) == 0);
    ASSERT_ERR((((uint32_t)rxadcsatdeten << 13) & ~((uint32_t)0x00002000)) == 0);
    ASSERT_ERR((((uint32_t)modemrxen << 12) & ~((uint32_t)0x00001000)) == 0);
    ASSERT_ERR((((uint32_t)rxadcen << 11) & ~((uint32_t)0x00000800)) == 0);
    ASSERT_ERR((((uint32_t)rxadcon << 10) & ~((uint32_t)0x00000400)) == 0);
    ASSERT_ERR((((uint32_t)agcen << 9) & ~((uint32_t)0x00000200)) == 0);
    ASSERT_ERR((((uint32_t)rssion << 8) & ~((uint32_t)0x00000100)) == 0);
    ASSERT_ERR((((uint32_t)rxfilton << 7) & ~((uint32_t)0x00000080)) == 0);
    ASSERT_ERR((((uint32_t)rxlobufon << 6) & ~((uint32_t)0x00000040)) == 0);
    ASSERT_ERR((((uint32_t)rxmixon << 5) & ~((uint32_t)0x00000020)) == 0);
    ASSERT_ERR((((uint32_t)rxlnaon << 4) & ~((uint32_t)0x00000010)) == 0);
    ASSERT_ERR((((uint32_t)rxrfbiason << 3) & ~((uint32_t)0x00000008)) == 0);
    ASSERT_ERR((((uint32_t)rxgainsel << 0) & ~((uint32_t)0x00000007)) == 0);
    REG_RPL_WR(RPL_RFRXCNTL_ADDR,  ((uint32_t)rxctrlforce << 31) | ((uint32_t)rxgainforce << 30) | ((uint32_t)forceaddarst << 29) | ((uint32_t)rssiclkinven << 25) | ((uint32_t)rxadcclkinven << 24) | ((uint32_t)nldoaddarst << 18) | ((uint32_t)rxadcsatdeten << 13) | ((uint32_t)modemrxen << 12) | ((uint32_t)rxadcen << 11) | ((uint32_t)rxadcon << 10) | ((uint32_t)agcen << 9) | ((uint32_t)rssion << 8) | ((uint32_t)rxfilton << 7) | ((uint32_t)rxlobufon << 6) | ((uint32_t)rxmixon << 5) | ((uint32_t)rxlnaon << 4) | ((uint32_t)rxrfbiason << 3) | ((uint32_t)rxgainsel << 0));
}

__STATIC_FORCEINLINE void rpl_rfrxcntl_unpack(uint8_t* rxctrlforce, uint8_t* rxgainforce, uint8_t* forceaddarst, uint8_t* rssiclkinven, uint8_t* rxadcclkinven, uint8_t* nldoaddarst, uint8_t* rxadcsatdeten, uint8_t* modemrxen, uint8_t* rxadcen, uint8_t* rxadcon, uint8_t* agcen, uint8_t* rssion, uint8_t* rxfilton, uint8_t* rxlobufon, uint8_t* rxmixon, uint8_t* rxlnaon, uint8_t* rxrfbiason, uint8_t* rxgainsel)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFRXCNTL_ADDR);

    *rxctrlforce = (localVal & ((uint32_t)0x80000000)) >> 31;
    *rxgainforce = (localVal & ((uint32_t)0x40000000)) >> 30;
    *forceaddarst = (localVal & ((uint32_t)0x20000000)) >> 29;
    *rssiclkinven = (localVal & ((uint32_t)0x02000000)) >> 25;
    *rxadcclkinven = (localVal & ((uint32_t)0x01000000)) >> 24;
    *nldoaddarst = (localVal & ((uint32_t)0x00040000)) >> 18;
    *rxadcsatdeten = (localVal & ((uint32_t)0x00002000)) >> 13;
    *modemrxen = (localVal & ((uint32_t)0x00001000)) >> 12;
    *rxadcen = (localVal & ((uint32_t)0x00000800)) >> 11;
    *rxadcon = (localVal & ((uint32_t)0x00000400)) >> 10;
    *agcen = (localVal & ((uint32_t)0x00000200)) >> 9;
    *rssion = (localVal & ((uint32_t)0x00000100)) >> 8;
    *rxfilton = (localVal & ((uint32_t)0x00000080)) >> 7;
    *rxlobufon = (localVal & ((uint32_t)0x00000040)) >> 6;
    *rxmixon = (localVal & ((uint32_t)0x00000020)) >> 5;
    *rxlnaon = (localVal & ((uint32_t)0x00000010)) >> 4;
    *rxrfbiason = (localVal & ((uint32_t)0x00000008)) >> 3;
    *rxgainsel = (localVal & ((uint32_t)0x00000007)) >> 0;
}

__STATIC_FORCEINLINE uint8_t rpl_rxctrl_force_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFRXCNTL_ADDR);
    return ((localVal & ((uint32_t)0x80000000)) >> 31);
}

__STATIC_FORCEINLINE void rpl_rxctrl_force_setf(uint8_t rxctrlforce)
{
    ASSERT_ERR((((uint32_t)rxctrlforce << 31) & ~((uint32_t)0x80000000)) == 0);
    REG_RPL_WR(RPL_RFRXCNTL_ADDR, (REG_RPL_RD(RPL_RFRXCNTL_ADDR) & ~((uint32_t)0x80000000)) | ((uint32_t)rxctrlforce << 31));
}

__STATIC_FORCEINLINE uint8_t rpl_rxgain_force_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFRXCNTL_ADDR);
    return ((localVal & ((uint32_t)0x40000000)) >> 30);
}

__STATIC_FORCEINLINE void rpl_rxgain_force_setf(uint8_t rxgainforce)
{
    ASSERT_ERR((((uint32_t)rxgainforce << 30) & ~((uint32_t)0x40000000)) == 0);
    REG_RPL_WR(RPL_RFRXCNTL_ADDR, (REG_RPL_RD(RPL_RFRXCNTL_ADDR) & ~((uint32_t)0x40000000)) | ((uint32_t)rxgainforce << 30));
}

