sriharimaddula/ble-sdk6-examples/SDK_6.0.24.1464/DA145xx_SDK/6.0.24.1464/sdk/platform/driver/ble/reg_ripple.h
// field definitions
#define RPL_TXFILT_IF_EN_BIT              ((uint32_t)0x80000000)
#define RPL_TXFILT_IF_EN_POS              31
#define RPL_TXDC_CAL_TIMEOUT_DELAY_MASK   ((uint32_t)0x0FF00000)
#define RPL_TXDC_CAL_TIMEOUT_DELAY_LSB    20
#define RPL_TXDC_CAL_TIMEOUT_DELAY_WIDTH  ((uint32_t)0x00000008)
#define RPL_FMTX2P_ON_DLYD_CNT_MASK       ((uint32_t)0x000F0000)
#define RPL_FMTX2P_ON_DLYD_CNT_LSB        16
#define RPL_FMTX2P_ON_DLYD_CNT_WIDTH      ((uint32_t)0x00000004)
#define RPL_FMTX_TRIM_MASK                ((uint32_t)0x0000C000)
#define RPL_FMTX_TRIM_LSB                 14
#define RPL_FMTX_TRIM_WIDTH               ((uint32_t)0x00000002)
#define RPL_TXMIX_TRIM_MASK               ((uint32_t)0x00003000)
#define RPL_TXMIX_TRIM_LSB                12
#define RPL_TXMIX_TRIM_WIDTH              ((uint32_t)0x00000002)
#define RPL_TXTANK_SEL_MASK               ((uint32_t)0x00000700)
#define RPL_TXTANK_SEL_LSB                8
#define RPL_TXTANK_SEL_WIDTH              ((uint32_t)0x00000003)
#define RPL_TXFILT_CFG_MASK               ((uint32_t)0x000000F0)
#define RPL_TXFILT_CFG_LSB                4
#define RPL_TXFILT_CFG_WIDTH              ((uint32_t)0x00000004)
#define RPL_TXPA_CFG_MASK                 ((uint32_t)0x00000007)
#define RPL_TXPA_CFG_LSB                  0
#define RPL_TXPA_CFG_WIDTH                ((uint32_t)0x00000003)

#define RPL_TXFILT_IF_EN_RST              0x1
#define RPL_TXDC_CAL_TIMEOUT_DELAY_RST    0xFF
#define RPL_FMTX2P_ON_DLYD_CNT_RST        0x0
#define RPL_FMTX_TRIM_RST                 0x0
#define RPL_TXMIX_TRIM_RST                0x0
#define RPL_TXTANK_SEL_RST                0x0
#define RPL_TXFILT_CFG_RST                0x0
#define RPL_TXPA_CFG_RST                  0x0

__STATIC_FORCEINLINE void rpl_rftxconfig_pack(uint8_t txfiltifen, uint8_t txdccaltimeoutdelay, uint8_t fmtx2pondlydcnt, uint8_t fmtxtrim, uint8_t txmixtrim, uint8_t txtanksel, uint8_t txfiltcfg, uint8_t txpacfg)
{
    ASSERT_ERR((((uint32_t)txfiltifen << 31) & ~((uint32_t)0x80000000)) == 0);
    ASSERT_ERR((((uint32_t)txdccaltimeoutdelay << 20) & ~((uint32_t)0x0FF00000)) == 0);
    ASSERT_ERR((((uint32_t)fmtx2pondlydcnt << 16) & ~((uint32_t)0x000F0000)) == 0);
    ASSERT_ERR((((uint32_t)fmtxtrim << 14) & ~((uint32_t)0x0000C000)) == 0);
    ASSERT_ERR((((uint32_t)txmixtrim << 12) & ~((uint32_t)0x00003000)) == 0);
    ASSERT_ERR((((uint32_t)txtanksel << 8) & ~((uint32_t)0x00000700)) == 0);
    ASSERT_ERR((((uint32_t)txfiltcfg << 4) & ~((uint32_t)0x000000F0)) == 0);
    ASSERT_ERR((((uint32_t)txpacfg << 0) & ~((uint32_t)0x00000007)) == 0);
    REG_RPL_WR(RPL_RFTXCONFIG_ADDR,  ((uint32_t)txfiltifen << 31) | ((uint32_t)txdccaltimeoutdelay << 20) | ((uint32_t)fmtx2pondlydcnt << 16) | ((uint32_t)fmtxtrim << 14) | ((uint32_t)txmixtrim << 12) | ((uint32_t)txtanksel << 8) | ((uint32_t)txfiltcfg << 4) | ((uint32_t)txpacfg << 0));
}

__STATIC_FORCEINLINE void rpl_rftxconfig_unpack(uint8_t* txfiltifen, uint8_t* txdccaltimeoutdelay, uint8_t* fmtx2pondlydcnt, uint8_t* fmtxtrim, uint8_t* txmixtrim, uint8_t* txtanksel, uint8_t* txfiltcfg, uint8_t* txpacfg)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFTXCONFIG_ADDR);

    *txfiltifen = (localVal & ((uint32_t)0x80000000)) >> 31;
    *txdccaltimeoutdelay = (localVal & ((uint32_t)0x0FF00000)) >> 20;
    *fmtx2pondlydcnt = (localVal & ((uint32_t)0x000F0000)) >> 16;
    *fmtxtrim = (localVal & ((uint32_t)0x0000C000)) >> 14;
    *txmixtrim = (localVal & ((uint32_t)0x00003000)) >> 12;
    *txtanksel = (localVal & ((uint32_t)0x00000700)) >> 8;
    *txfiltcfg = (localVal & ((uint32_t)0x000000F0)) >> 4;
    *txpacfg = (localVal & ((uint32_t)0x00000007)) >> 0;
}

__STATIC_FORCEINLINE uint8_t rpl_txfilt_if_en_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFTXCONFIG_ADDR);
    return ((localVal & ((uint32_t)0x80000000)) >> 31);
}

__STATIC_FORCEINLINE void rpl_txfilt_if_en_setf(uint8_t txfiltifen)
{
    ASSERT_ERR((((uint32_t)txfiltifen << 31) & ~((uint32_t)0x80000000)) == 0);
    REG_RPL_WR(RPL_RFTXCONFIG_ADDR, (REG_RPL_RD(RPL_RFTXCONFIG_ADDR) & ~((uint32_t)0x80000000)) | ((uint32_t)txfiltifen << 31));
}

__STATIC_FORCEINLINE uint8_t rpl_txdc_cal_timeout_delay_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFTXCONFIG_ADDR);
    return ((localVal & ((uint32_t)0x0FF00000)) >> 20);
}

__STATIC_FORCEINLINE void rpl_txdc_cal_timeout_delay_setf(uint8_t txdccaltimeoutdelay)
{
    ASSERT_ERR((((uint32_t)txdccaltimeoutdelay << 20) & ~((uint32_t)0x0FF00000)) == 0);
    REG_RPL_WR(RPL_RFTXCONFIG_ADDR, (REG_RPL_RD(RPL_RFTXCONFIG_ADDR) & ~((uint32_t)0x0FF00000)) | ((uint32_t)txdccaltimeoutdelay << 20));
}

__STATIC_FORCEINLINE uint8_t rpl_fmtx2p_on_dlyd_cnt_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFTXCONFIG_ADDR);
    return ((localVal & ((uint32_t)0x000F0000)) >> 16);
}

__STATIC_FORCEINLINE void rpl_fmtx2p_on_dlyd_cnt_setf(uint8_t fmtx2pondlydcnt)
{
    ASSERT_ERR((((uint32_t)fmtx2pondlydcnt << 16) & ~((uint32_t)0x000F0000)) == 0);
    REG_RPL_WR(RPL_RFTXCONFIG_ADDR, (REG_RPL_RD(RPL_RFTXCONFIG_ADDR) & ~((uint32_t)0x000F0000)) | ((uint32_t)fmtx2pondlydcnt << 16));
}

__STATIC_FORCEINLINE uint8_t rpl_fmtx_trim_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFTXCONFIG_ADDR);
    return ((localVal & ((uint32_t)0x0000C000)) >> 14);
}

__STATIC_FORCEINLINE void rpl_fmtx_trim_setf(uint8_t fmtxtrim)
{
    ASSERT_ERR((((uint32_t)fmtxtrim << 14) & ~((uint32_t)0x0000C000)) == 0);
    REG_RPL_WR(RPL_RFTXCONFIG_ADDR, (REG_RPL_RD(RPL_RFTXCONFIG_ADDR) & ~((uint32_t)0x0000C000)) | ((uint32_t)fmtxtrim << 14));
}

__STATIC_FORCEINLINE uint8_t rpl_txmix_trim_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFTXCONFIG_ADDR);
    return ((localVal & ((uint32_t)0x00003000)) >> 12);
}

__STATIC_FORCEINLINE void rpl_txmix_trim_setf(uint8_t txmixtrim)
{
    ASSERT_ERR((((uint32_t)txmixtrim << 12) & ~((uint32_t)0x00003000)) == 0);
    REG_RPL_WR(RPL_RFTXCONFIG_ADDR, (REG_RPL_RD(RPL_RFTXCONFIG_ADDR) & ~((uint32_t)0x00003000)) | ((uint32_t)txmixtrim << 12));
}

__STATIC_FORCEINLINE uint8_t rpl_txtank_sel_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFTXCONFIG_ADDR);
    return ((localVal & ((uint32_t)0x00000700)) >> 8);
}

__STATIC_FORCEINLINE void rpl_txtank_sel_setf(uint8_t txtanksel)
{
    ASSERT_ERR((((uint32_t)txtanksel << 8) & ~((uint32_t)0x00000700)) == 0);
    REG_RPL_WR(RPL_RFTXCONFIG_ADDR, (REG_RPL_RD(RPL_RFTXCONFIG_ADDR) & ~((uint32_t)0x00000700)) | ((uint32_t)txtanksel << 8));
}

__STATIC_FORCEINLINE uint8_t rpl_txfilt_cfg_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFTXCONFIG_ADDR);
    return ((localVal & ((uint32_t)0x000000F0)) >> 4);
}

