sriharimaddula/ble-sdk6-examples/SDK_6.0.24.1464/DA145xx_SDK/6.0.24.1464/sdk/platform/driver/ble/reg_ripple.h
__STATIC_FORCEINLINE void rpl_txfilt_cfg_setf(uint8_t txfiltcfg)
{
    ASSERT_ERR((((uint32_t)txfiltcfg << 4) & ~((uint32_t)0x000000F0)) == 0);
    REG_RPL_WR(RPL_RFTXCONFIG_ADDR, (REG_RPL_RD(RPL_RFTXCONFIG_ADDR) & ~((uint32_t)0x000000F0)) | ((uint32_t)txfiltcfg << 4));
}

__STATIC_FORCEINLINE uint8_t rpl_txpa_cfg_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFTXCONFIG_ADDR);
    return ((localVal & ((uint32_t)0x00000007)) >> 0);
}

__STATIC_FORCEINLINE void rpl_txpa_cfg_setf(uint8_t txpacfg)
{
    ASSERT_ERR((((uint32_t)txpacfg << 0) & ~((uint32_t)0x00000007)) == 0);
    REG_RPL_WR(RPL_RFTXCONFIG_ADDR, (REG_RPL_RD(RPL_RFTXCONFIG_ADDR) & ~((uint32_t)0x00000007)) | ((uint32_t)txpacfg << 0));
}

/**
 * @brief RFTXSTAT register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  16:12            TXDCQ_VAL   0x0
 *  08:04            TXDCI_VAL   0x0
 *     01        TXDC_CAL_DEAD   0
 *     00        TXDC_CAL_DONE   0
 * </pre>
 */
#define RPL_RFTXSTAT_ADDR   0x00000072
#define RPL_RFTXSTAT_OFFSET 0x00000072
#define RPL_RFTXSTAT_INDEX  0x00000072
#define RPL_RFTXSTAT_RESET  0x00000000

__STATIC_FORCEINLINE uint32_t rpl_rftxstat_get(void)
{
    return REG_RPL_RD(RPL_RFTXSTAT_ADDR);
}

// field definitions
#define RPL_TXDCQ_VAL_MASK       ((uint32_t)0x0001F000)
#define RPL_TXDCQ_VAL_LSB        12
#define RPL_TXDCQ_VAL_WIDTH      ((uint32_t)0x00000005)
#define RPL_TXDCI_VAL_MASK       ((uint32_t)0x000001F0)
#define RPL_TXDCI_VAL_LSB        4
#define RPL_TXDCI_VAL_WIDTH      ((uint32_t)0x00000005)
#define RPL_TXDC_CAL_DEAD_BIT    ((uint32_t)0x00000002)
#define RPL_TXDC_CAL_DEAD_POS    1
#define RPL_TXDC_CAL_DONE_BIT    ((uint32_t)0x00000001)
#define RPL_TXDC_CAL_DONE_POS    0

#define RPL_TXDCQ_VAL_RST        0x0
#define RPL_TXDCI_VAL_RST        0x0
#define RPL_TXDC_CAL_DEAD_RST    0x0
#define RPL_TXDC_CAL_DONE_RST    0x0

__STATIC_FORCEINLINE void rpl_rftxstat_unpack(uint8_t* txdcqval, uint8_t* txdcival, uint8_t* txdccaldead, uint8_t* txdccaldone)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFTXSTAT_ADDR);

    *txdcqval = (localVal & ((uint32_t)0x0001F000)) >> 12;
    *txdcival = (localVal & ((uint32_t)0x000001F0)) >> 4;
    *txdccaldead = (localVal & ((uint32_t)0x00000002)) >> 1;
    *txdccaldone = (localVal & ((uint32_t)0x00000001)) >> 0;
}

__STATIC_FORCEINLINE uint8_t rpl_txdcq_val_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFTXSTAT_ADDR);
    return ((localVal & ((uint32_t)0x0001F000)) >> 12);
}

__STATIC_FORCEINLINE uint8_t rpl_txdci_val_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFTXSTAT_ADDR);
    return ((localVal & ((uint32_t)0x000001F0)) >> 4);
}

__STATIC_FORCEINLINE uint8_t rpl_txdc_cal_dead_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFTXSTAT_ADDR);
    return ((localVal & ((uint32_t)0x00000002)) >> 1);
}

__STATIC_FORCEINLINE uint8_t rpl_txdc_cal_done_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFTXSTAT_ADDR);
    return ((localVal & ((uint32_t)0x00000001)) >> 0);
}

/**
 * @brief RFTXRXCNTL register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *     31       TXRXCTRL_FORCE   0
 *     30   VCOFC_ICP_CAL_FORCE   0
 *     12   VCOFC_CAL_ICP_MODE   0
 *     09      RXMDM_BYPASS_EN   0
 *     08      TXMDM_BYPASS_EN   0
 *     06   RFPLL_CAL_TIMEOUT_DSB   0
 *     05        ICP_CAL_START   0
 *     04      VCOFC_CAL_START   0
 *     02                PD_ON   0
 *     01           BB_BIAS_ON   0
 *     00            LODIV2_ON   0
 * </pre>
 */
#define RPL_RFTXRXCNTL_ADDR   0x00000073
#define RPL_RFTXRXCNTL_OFFSET 0x00000073
#define RPL_RFTXRXCNTL_INDEX  0x00000073
#define RPL_RFTXRXCNTL_RESET  0x00000000

__STATIC_FORCEINLINE uint32_t rpl_rftxrxcntl_get(void)
{
    return REG_RPL_RD(RPL_RFTXRXCNTL_ADDR);
}

__STATIC_FORCEINLINE void rpl_rftxrxcntl_set(uint32_t value)
{
    REG_RPL_WR(RPL_RFTXRXCNTL_ADDR, value);
}

// field definitions
#define RPL_TXRXCTRL_FORCE_BIT           ((uint32_t)0x80000000)
#define RPL_TXRXCTRL_FORCE_POS           31
#define RPL_VCOFC_ICP_CAL_FORCE_BIT      ((uint32_t)0x40000000)
#define RPL_VCOFC_ICP_CAL_FORCE_POS      30
#define RPL_VCOFC_CAL_ICP_MODE_BIT       ((uint32_t)0x00001000)
#define RPL_VCOFC_CAL_ICP_MODE_POS       12
#define RPL_RXMDM_BYPASS_EN_BIT          ((uint32_t)0x00000200)
#define RPL_RXMDM_BYPASS_EN_POS          9
#define RPL_TXMDM_BYPASS_EN_BIT          ((uint32_t)0x00000100)
#define RPL_TXMDM_BYPASS_EN_POS          8
#define RPL_RFPLL_CAL_TIMEOUT_DSB_BIT    ((uint32_t)0x00000040)
#define RPL_RFPLL_CAL_TIMEOUT_DSB_POS    6
#define RPL_ICP_CAL_START_BIT            ((uint32_t)0x00000020)
#define RPL_ICP_CAL_START_POS            5
#define RPL_VCOFC_CAL_START_BIT          ((uint32_t)0x00000010)
#define RPL_VCOFC_CAL_START_POS          4
#define RPL_PD_ON_BIT                    ((uint32_t)0x00000004)
#define RPL_PD_ON_POS                    2
#define RPL_BB_BIAS_ON_BIT               ((uint32_t)0x00000002)
#define RPL_BB_BIAS_ON_POS               1
#define RPL_LODIV2_ON_BIT                ((uint32_t)0x00000001)
#define RPL_LODIV2_ON_POS                0

#define RPL_TXRXCTRL_FORCE_RST           0x0
#define RPL_VCOFC_ICP_CAL_FORCE_RST      0x0
#define RPL_VCOFC_CAL_ICP_MODE_RST       0x0
#define RPL_RXMDM_BYPASS_EN_RST          0x0
#define RPL_TXMDM_BYPASS_EN_RST          0x0
#define RPL_RFPLL_CAL_TIMEOUT_DSB_RST    0x0
#define RPL_ICP_CAL_START_RST            0x0
#define RPL_VCOFC_CAL_START_RST          0x0
#define RPL_PD_ON_RST                    0x0
#define RPL_BB_BIAS_ON_RST               0x0
#define RPL_LODIV2_ON_RST                0x0

__STATIC_FORCEINLINE void rpl_rftxrxcntl_pack(uint8_t txrxctrlforce, uint8_t vcofcicpcalforce, uint8_t vcofccalicpmode, uint8_t rxmdmbypassen, uint8_t txmdmbypassen, uint8_t rfpllcaltimeoutdsb, uint8_t icpcalstart, uint8_t vcofccalstart, uint8_t pdon, uint8_t bbbiason, uint8_t lodiv2on)
{
    ASSERT_ERR((((uint32_t)txrxctrlforce << 31) & ~((uint32_t)0x80000000)) == 0);
    ASSERT_ERR((((uint32_t)vcofcicpcalforce << 30) & ~((uint32_t)0x40000000)) == 0);
    ASSERT_ERR((((uint32_t)vcofccalicpmode << 12) & ~((uint32_t)0x00001000)) == 0);
    ASSERT_ERR((((uint32_t)rxmdmbypassen << 9) & ~((uint32_t)0x00000200)) == 0);
    ASSERT_ERR((((uint32_t)txmdmbypassen << 8) & ~((uint32_t)0x00000100)) == 0);
    ASSERT_ERR((((uint32_t)rfpllcaltimeoutdsb << 6) & ~((uint32_t)0x00000040)) == 0);
    ASSERT_ERR((((uint32_t)icpcalstart << 5) & ~((uint32_t)0x00000020)) == 0);
    ASSERT_ERR((((uint32_t)vcofccalstart << 4) & ~((uint32_t)0x00000010)) == 0);
    ASSERT_ERR((((uint32_t)pdon << 2) & ~((uint32_t)0x00000004)) == 0);
    ASSERT_ERR((((uint32_t)bbbiason << 1) & ~((uint32_t)0x00000002)) == 0);
    ASSERT_ERR((((uint32_t)lodiv2on << 0) & ~((uint32_t)0x00000001)) == 0);
    REG_RPL_WR(RPL_RFTXRXCNTL_ADDR,  ((uint32_t)txrxctrlforce << 31) | ((uint32_t)vcofcicpcalforce << 30) | ((uint32_t)vcofccalicpmode << 12) | ((uint32_t)rxmdmbypassen << 9) | ((uint32_t)txmdmbypassen << 8) | ((uint32_t)rfpllcaltimeoutdsb << 6) | ((uint32_t)icpcalstart << 5) | ((uint32_t)vcofccalstart << 4) | ((uint32_t)pdon << 2) | ((uint32_t)bbbiason << 1) | ((uint32_t)lodiv2on << 0));
}

__STATIC_FORCEINLINE void rpl_rftxrxcntl_unpack(uint8_t* txrxctrlforce, uint8_t* vcofcicpcalforce, uint8_t* vcofccalicpmode, uint8_t* rxmdmbypassen, uint8_t* txmdmbypassen, uint8_t* rfpllcaltimeoutdsb, uint8_t* icpcalstart, uint8_t* vcofccalstart, uint8_t* pdon, uint8_t* bbbiason, uint8_t* lodiv2on)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFTXRXCNTL_ADDR);

