sriharimaddula/ble-sdk6-examples/SDK_6.0.24.1464/DA145xx_SDK/6.0.24.1464/sdk/platform/driver/ble/reg_ripple.h
__STATIC_FORCEINLINE uint8_t rpl_sar_adc_force_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_SAR_ADC_CNTL_ADDR);
    return ((localVal & ((uint32_t)0x80000000)) >> 31);
}

__STATIC_FORCEINLINE void rpl_sar_adc_force_setf(uint8_t saradcforce)
{
    ASSERT_ERR((((uint32_t)saradcforce << 31) & ~((uint32_t)0x80000000)) == 0);
    REG_RPL_WR(RPL_SAR_ADC_CNTL_ADDR, (REG_RPL_RD(RPL_SAR_ADC_CNTL_ADDR) & ~((uint32_t)0x80000000)) | ((uint32_t)saradcforce << 31));
}

__STATIC_FORCEINLINE uint8_t rpl_sar_adc_sel_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_SAR_ADC_CNTL_ADDR);
    return ((localVal & ((uint32_t)0x000000F0)) >> 4);
}

__STATIC_FORCEINLINE void rpl_sar_adc_sel_setf(uint8_t saradcsel)
{
    ASSERT_ERR((((uint32_t)saradcsel << 4) & ~((uint32_t)0x000000F0)) == 0);
    REG_RPL_WR(RPL_SAR_ADC_CNTL_ADDR, (REG_RPL_RD(RPL_SAR_ADC_CNTL_ADDR) & ~((uint32_t)0x000000F0)) | ((uint32_t)saradcsel << 4));
}

__STATIC_FORCEINLINE uint8_t rpl_sar_adc_mode_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_SAR_ADC_CNTL_ADDR);
    return ((localVal & ((uint32_t)0x00000004)) >> 2);
}

__STATIC_FORCEINLINE void rpl_sar_adc_mode_setf(uint8_t saradcmode)
{
    ASSERT_ERR((((uint32_t)saradcmode << 2) & ~((uint32_t)0x00000004)) == 0);
    REG_RPL_WR(RPL_SAR_ADC_CNTL_ADDR, (REG_RPL_RD(RPL_SAR_ADC_CNTL_ADDR) & ~((uint32_t)0x00000004)) | ((uint32_t)saradcmode << 2));
}

__STATIC_FORCEINLINE uint8_t rpl_sar_adc_start_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_SAR_ADC_CNTL_ADDR);
    return ((localVal & ((uint32_t)0x00000002)) >> 1);
}

__STATIC_FORCEINLINE void rpl_sar_adc_start_setf(uint8_t saradcstart)
{
    ASSERT_ERR((((uint32_t)saradcstart << 1) & ~((uint32_t)0x00000002)) == 0);
    REG_RPL_WR(RPL_SAR_ADC_CNTL_ADDR, (REG_RPL_RD(RPL_SAR_ADC_CNTL_ADDR) & ~((uint32_t)0x00000002)) | ((uint32_t)saradcstart << 1));
}

__STATIC_FORCEINLINE uint8_t rpl_sar_adc_on_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_SAR_ADC_CNTL_ADDR);
    return ((localVal & ((uint32_t)0x00000001)) >> 0);
}

__STATIC_FORCEINLINE void rpl_sar_adc_on_setf(uint8_t saradcon)
{
    ASSERT_ERR((((uint32_t)saradcon << 0) & ~((uint32_t)0x00000001)) == 0);
    REG_RPL_WR(RPL_SAR_ADC_CNTL_ADDR, (REG_RPL_RD(RPL_SAR_ADC_CNTL_ADDR) & ~((uint32_t)0x00000001)) | ((uint32_t)saradcon << 0));
}

/**
 * @brief SAR_ADC_STAT register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *     31         SAR_ADC_DONE   0
 *  09:00          SAR_ADC_VAL   0x0
 * </pre>
 */
#define RPL_SAR_ADC_STAT_ADDR   0x00000077
#define RPL_SAR_ADC_STAT_OFFSET 0x00000077
#define RPL_SAR_ADC_STAT_INDEX  0x00000077
#define RPL_SAR_ADC_STAT_RESET  0x00000000

__STATIC_FORCEINLINE uint32_t rpl_sar_adc_stat_get(void)
{
    return REG_RPL_RD(RPL_SAR_ADC_STAT_ADDR);
}

// field definitions
#define RPL_SAR_ADC_DONE_BIT    ((uint32_t)0x80000000)
#define RPL_SAR_ADC_DONE_POS    31
#define RPL_SAR_ADC_VAL_MASK    ((uint32_t)0x000003FF)
#define RPL_SAR_ADC_VAL_LSB     0
#define RPL_SAR_ADC_VAL_WIDTH   ((uint32_t)0x0000000A)

#define RPL_SAR_ADC_DONE_RST    0x0
#define RPL_SAR_ADC_VAL_RST     0x0

__STATIC_FORCEINLINE void rpl_sar_adc_stat_unpack(uint8_t* saradcdone, uint16_t* saradcval)
{
    uint32_t localVal = REG_RPL_RD(RPL_SAR_ADC_STAT_ADDR);

    *saradcdone = (localVal & ((uint32_t)0x80000000)) >> 31;
    *saradcval = (localVal & ((uint32_t)0x000003FF)) >> 0;
}

__STATIC_FORCEINLINE uint8_t rpl_sar_adc_done_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_SAR_ADC_STAT_ADDR);
    return ((localVal & ((uint32_t)0x80000000)) >> 31);
}

__STATIC_FORCEINLINE uint16_t rpl_sar_adc_val_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_SAR_ADC_STAT_ADDR);
    return ((localVal & ((uint32_t)0x000003FF)) >> 0);
}

/**
 * @brief RXADC_SATDET_CONFIG register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  31:30    RXADC_SATDET_MODE   0x2
 *  14:08     RXADC_SATDET_THR   0x14
 *  06:00   RXADC_SATDET_WINDOW   0x40
 * </pre>
 */
#define RPL_RXADC_SATDET_CONFIG_ADDR   0x00000078
#define RPL_RXADC_SATDET_CONFIG_OFFSET 0x00000078
#define RPL_RXADC_SATDET_CONFIG_INDEX  0x00000078
#define RPL_RXADC_SATDET_CONFIG_RESET  0x80001440

__STATIC_FORCEINLINE uint32_t rpl_rxadc_satdet_config_get(void)
{
    return REG_RPL_RD(RPL_RXADC_SATDET_CONFIG_ADDR);
}

__STATIC_FORCEINLINE void rpl_rxadc_satdet_config_set(uint32_t value)
{
    REG_RPL_WR(RPL_RXADC_SATDET_CONFIG_ADDR, value);
}

// field definitions
#define RPL_RXADC_SATDET_MODE_MASK     ((uint32_t)0xC0000000)
#define RPL_RXADC_SATDET_MODE_LSB      30
#define RPL_RXADC_SATDET_MODE_WIDTH    ((uint32_t)0x00000002)
#define RPL_RXADC_SATDET_THR_MASK      ((uint32_t)0x00007F00)
#define RPL_RXADC_SATDET_THR_LSB       8
#define RPL_RXADC_SATDET_THR_WIDTH     ((uint32_t)0x00000007)
#define RPL_RXADC_SATDET_WINDOW_MASK   ((uint32_t)0x0000007F)
#define RPL_RXADC_SATDET_WINDOW_LSB    0
#define RPL_RXADC_SATDET_WINDOW_WIDTH  ((uint32_t)0x00000007)

#define RPL_RXADC_SATDET_MODE_RST      0x2
#define RPL_RXADC_SATDET_THR_RST       0x14
#define RPL_RXADC_SATDET_WINDOW_RST    0x40

__STATIC_FORCEINLINE void rpl_rxadc_satdet_config_pack(uint8_t rxadcsatdetmode, uint8_t rxadcsatdetthr, uint8_t rxadcsatdetwindow)
{
    ASSERT_ERR((((uint32_t)rxadcsatdetmode << 30) & ~((uint32_t)0xC0000000)) == 0);
    ASSERT_ERR((((uint32_t)rxadcsatdetthr << 8) & ~((uint32_t)0x00007F00)) == 0);
    ASSERT_ERR((((uint32_t)rxadcsatdetwindow << 0) & ~((uint32_t)0x0000007F)) == 0);
    REG_RPL_WR(RPL_RXADC_SATDET_CONFIG_ADDR,  ((uint32_t)rxadcsatdetmode << 30) | ((uint32_t)rxadcsatdetthr << 8) | ((uint32_t)rxadcsatdetwindow << 0));
}

__STATIC_FORCEINLINE void rpl_rxadc_satdet_config_unpack(uint8_t* rxadcsatdetmode, uint8_t* rxadcsatdetthr, uint8_t* rxadcsatdetwindow)
{
    uint32_t localVal = REG_RPL_RD(RPL_RXADC_SATDET_CONFIG_ADDR);

